import { Question } from './question';
import { InMemoryDbService } from 'angular-in-memory-web-api';
import { Injectable } from '@angular/core';

// tslint:disable:max-line-length
@Injectable({
  providedIn: 'root'
})
export class InMemoryDataService implements InMemoryDbService {
  createDb() {
    const commaQuestions = [
      {id: 1, questionText: `Виконт был подан обществу в самом изящном и выгодном для него свете<span class="highlightText">&nbsp;?&nbsp;</span>как ростбиф на горячем блюде, посыпанный зеленью.`, correctText: `Виконт был подан обществу в самом изящном и выгодном для него свете<span class="highlightText">,&nbsp;</span>как ростбиф на горячем блюде, посыпанный зеленью.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Запятая нужна, потому что это сравнение.`, needed: true}, { name: 'Без запятой, это сказуемое',  ruleInfo: `Запятая нужна, потому что это сравнение.`, needed: false}], helpMessage: 'Автор сравнивает виконта с ростбифом, сказуемое — «был подан».', author: `Л. Н. Толстой
«Война и мир»`}
, {id: 2, questionText: `Ничто так не нужно молодому человеку<span class="highlightText">&nbsp;?&nbsp;</span>как общество умных женщин.`, correctText: `Ничто так не нужно молодому человеку<span class="highlightText">,&nbsp;</span>как общество умных женщин.`, buttons: [{name: 'Запятая всегда нужна в такой конструкции', ruleInfo: `Запятая всегда нужна в конструкции «ничто так не… , как».`, needed: true}, { name: 'Без запятой, значение «в качестве»',  ruleInfo: `Запятая всегда нужна в конструкции «ничто так не… , как».`, needed: false}], helpMessage: 'Если в первой части предложения есть слово «так», «такой», «тот», то запятая всегда ставится. Кроме случаев с союзом «так как».', author: `Л. Н. Толстой
«Война и мир»`}
, {id: 3, questionText: `Пьер был неуклюж. Он<span class="highlightText">&nbsp;?&nbsp;</span>как говорится<span class="highlightText">&nbsp;?&nbsp;</span>не умел войти в салон и еще менее умел из него выйти.`, correctText: `Пьер был неуклюж. Он<span class="highlightText">,&nbsp;</span>как говорится<span class="highlightText">,&nbsp;</span>не умел войти в салон и еще менее умел из него выйти.`, buttons: [{name: 'Запятая нужна, это вводное словосочетание', ruleInfo: `«Как говорится» — вводная конструкция и выделяется запятыми.`, needed: true}, { name: 'Без запятой, это фразеологизм',  ruleInfo: `«Как говорится» — вводная конструкция и выделяется запятыми.`, needed: false}], helpMessage: 'Запятыми выделяются вводные словосочетания «как говорят», «как водится», «как всегда» и т.п.', author: `Л. Н. Толстой
«Война и мир»`}
, {id: 4, questionText: `Москве больше делать нечего<span class="highlightText">&nbsp;?&nbsp;</span> как сплетничать.`, correctText: `Москве больше делать нечего<span class="highlightText">,&nbsp;</span>как сплетничать.`, buttons: [{name: 'Запятая нужна, значение исключения', ruleInfo: `Оборот с «как» выделяется запятой, потому что имеет значение исключения.`, needed: true}, { name: 'Без запятой, часть сказуемого',  ruleInfo: `Оборот с «как» выделяется запятой, потому что имеет значение исключения. Проверка: можно заменить на «кроме как».`, needed: false}], helpMessage: 'Москве больше делать нечего, кроме как сплетничать.', author: `Л. Н. Толстой
«Война и мир»`}
, {id: 5, questionText: `Француз стоял<span class="highlightText">&nbsp;?&nbsp;</span>как вкопанный.`, correctText: `Француз стоял<span class="highlightText">&nbsp;</span>как вкопанный.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `«Стоял как вкопанный» — фразеологизм, пишется без запятой.`, needed: false}, { name: 'Без запятой, это фразеологизм',  ruleInfo: `«Стоял как вкопанный» — фразеологизм, пишется без запятой.`, needed: true}], helpMessage: 'Француз свалился как снег на голову.', author: `А.С. Пушкин
«Дубровский»`}
, {id: 6, questionText: `Один Иван Петрович был<span class="highlightText">&nbsp;?&nbsp;</span>как дома: ел за двоих, пил в свою меру, смеялся своему смеху.`, correctText: `Один Иван Петрович был<span class="highlightText">&nbsp;</span>как дома: ел за двоих, пил в свою меру, смеялся своему смеху.`, buttons: [{name: 'Запятая нужна, есть значение причины', ruleInfo: `Сказуемое — «был как дома», а запятой внутри сказуемого быть не может.`, needed: false}, { name: 'Без запятой, это часть сказуемого',  ruleInfo: `Сказуемое — «был как дома», а запятой внутри сказуемого быть не может.`, needed: true}], helpMessage: 'Будет ли предложение понятным без этого словосочетания?', author: `А.С. Пушкин
«Барышня-крестьянка»`}
, {id: 7, questionText: `И Ленский, жмуря левый глаз<br />
Стал тоже целить, но<span class="highlightText">&nbsp;?&nbsp;</span>как раз<span class="highlightText">&nbsp;?&nbsp;</span><br />
Онегин выстрелил.`, correctText: `И Ленский, жмуря левый глаз<br />
Стал тоже целить, но<span class="highlightText">&nbsp;</span>как раз<span class="highlightText">&nbsp;</span><br />
Онегин выстрелил.`, buttons: [{name: 'Запятая нужна, это вводное словосочетание', ruleInfo: `«Как раз» — усилительная частица и никогда не выделяется запятыми.`, needed: false}, { name: 'Без запятой, это частица',  ruleInfo: `Запятая не нужна, «как раз» — усилительная частица и никогда не выделяется.`, needed: true}], helpMessage: '«Как раз», «только», «лишь» — усилительные частицы.', author: `А.С. Пушкин
«Евгений Онегин»`}
, {id: 8, questionText: `Промчалось много, много дней,<br />
С тех пор<span class="highlightText">&nbsp;?&nbsp;</span>как юная Татьяна<br />
И с ней Онегин в смутном сне<br />
Явилися впервые мне.`, correctText: `Промчалось много, много дней,<br />
С тех пор<span class="highlightText">&nbsp;</span>как юная Татьяна<br />
И с ней Онегин в смутном сне<br />
Явилися впервые мне.`, buttons: [{name: 'Запятая нужна, это сложное предложение', ruleInfo: `Предложение сложное, но запятая не нужна, так как она уже стоит перед сложным союзом «с тех пор как».`, needed: false}, { name: 'Без запятой, это сложный союз',  ruleInfo: `Запятая не нужна, так как она уже стоит перед сложным союзом «с тех пор как». Если бы её не было, перед «как» нужна была бы запятая.`, needed: true}], helpMessage: 'Между частями этого сложного предложения уже стоит запятая.', author: `А.С. Пушкин
«Евгений Онегин»`}
, {id: 9, questionText: `Ты женишься, или я тебя прокляну, а имение<span class="highlightText">&nbsp;?&nbsp;</span>как бог свят<span class="highlightText">&nbsp;?&nbsp;</span>продам и промотаю!`, correctText: `Ты женишься, или я тебя прокляну, а имение<span class="highlightText">,&nbsp;</span>как бог свят<span class="highlightText">,&nbsp;</span>продам и промотаю!`, buttons: [{name: 'Запятая нужна, это вводное словосочетание', ruleInfo: `«Как бог свят», «вот те крест», «честное слово» — вводные словосочетания. Выделяются запятыми.`, needed: true}, { name: 'Без запятой, это частица',  ruleInfo: `«Как бог свят», «вот те крест», «честное слово» — вводные словосочетания. Выделяются запятыми.`, needed: false}], helpMessage: 'Вводные словосочетания «вот те крест», «честное слово» выражают уверенность говорящего.', author: `А.С. Пушкин
«Барышня-крестьянка»`}
, {id: 10, questionText: `Лучший стрелок, которого удалось мне встречать, стрелял каждый день, по крайней мере три раза перед обедом. Это у него было заведено<span class="highlightText">&nbsp;?&nbsp;</span>как рюмка водки.`, correctText: `Лучший стрелок, которого удалось мне встречать, стрелял каждый день, по крайней мере три раза перед обедом. Это у него было заведено<span class="highlightText">,&nbsp;</span>как рюмка водки.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Сравнительный оборот выделяется запятой.`, needed: true}, { name: 'Без запятой, это часть сказуемого',  ruleInfo: `Запятая нужна, так как это сравнительный оборот, а «заведено» — это сказуемое.`, needed: false}], helpMessage: 'Если удалить сравнение, смысл предложения по-прежнему будет понятен.', author: `А.С. Пушкин
«Выстрел»`}
, {id: 11, questionText: `Приказчика моего нашли на другой день в лесу, привязанного к дубу и ободранного<span class="highlightText">&nbsp;?&nbsp;</span>как липку.`, correctText: `Приказчика моего нашли на другой день в лесу, привязанного к дубу и ободранного<span class="highlightText">&nbsp;</span>как липку.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `«Ободрать как липку» — фразеологизм, пишется без запятой.`, needed: false}, { name: 'Без запятой, это фразеологизм',  ruleInfo: `«Ободрать как липку» — фразеологизм, пишется без запятой.`, needed: true}], helpMessage: 'Его ободрали как липку — и он стал гол как сокол.', author: `А.С. Пушкин
«Дубровский»`}
, {id: 12, questionText: `Вот уж 5 часов<span class="highlightText">&nbsp;?&nbsp;</span>как дожидается лошадей да свищет. Надоел проклятый.`, correctText: `Вот уж 5 часов<span class="highlightText">&nbsp;</span>как дожидается лошадей да свищет. Надоел проклятый.`, buttons: [{name: 'Запятая нужна, сложное предложение', ruleInfo: `Запятая не ставится, потому что «как» — усилительная частица. `, needed: false}, { name: 'Без запятой, «как» — частица',  ruleInfo: `Запятая не ставится, потому что «как» — усилительная частица. `, needed: true}], helpMessage: 'Вот уж 5 часов всё дожидается лошадей да свищет.', author: `А.С. Пушкин
«Дубровский»`}
, {id: 13, questionText: `Руслан уныньем<span class="highlightText">&nbsp;?&nbsp;</span>как убит;<br />
Мысль о потерянной невесте<br />
Его терзает и мертвит.`, correctText: `Руслан уныньем<span class="highlightText">&nbsp;</span>как убит;
Мысль о потерянной невесте
Его терзает и мертвит.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Это сказуемое, а запятая между подлежащим и сказуемым не ставится.`, needed: false}, { name: 'Без запятой, это сказуемое',  ruleInfo: `Запятая не нужна перед сказуемым. Проверка: если убрать «как убит» из предложения, смысл будет неясен.`, needed: true}], helpMessage: 'Предложение не потеряет смысла, если выбросить из него сравнение.', author: `А.С. Пушкин
«Руслан и Людмила»`}
, {id: 14, questionText: `Уж витязь под горой стоит,<br />
Призывный рог<span class="highlightText">&nbsp;?&nbsp;</span>как буря<span class="highlightText">&nbsp;?&nbsp;</span> воет,<br />
Нетерпеливый конь кипит<br />
И снег копытом мочным роет.`, correctText: `Уж витязь под горой стоит,<br />
Призывный рог<span class="highlightText">,&nbsp;</span>как буря<span class="highlightText">,&nbsp;</span>воет,<br />
Нетерпеливый конь кипит<br />
И снег копытом мочным роет.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Это сравнение, выделяется запятыми.`, needed: true}, { name: 'Без запятой, это фразеологизм',  ruleInfo: `Это сравнение, выделяется запятыми.`, needed: false}], helpMessage: 'Предложение потеряет смысла, если выбросить из него сказуемое.', author: `А.С. Пушкин
«Руслан и Людмила»`}
, {id: 15, questionText: `А их глазищи желтые<br />
Горят<span class="highlightText">&nbsp;?&nbsp;</span>как воску ярого<br />
Четырнадцать свечей!`, correctText: `А их глазищи желтые<br />
Горят<span class="highlightText">,&nbsp;</span>как воску ярого<br />
Четырнадцать свечей!`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Это сравнение, выделяется запятыми.`, needed: true}, { name: 'Без запятой, значение «в качестве»',  ruleInfo: `Это сравнение, выделяется запятыми.`, needed: false}], helpMessage: 'Можно ли «как» заменить на «в качестве»?', author: `Н.А. Некрасов
«Кому на Руси жить хорошо»`}
, {id: 16, questionText: `Мой совет: обвенчаться<span class="highlightText">&nbsp;?&nbsp;</span>как можно скорее<span class="highlightText">&nbsp;?&nbsp;</span>в вашей деревянной церкви и приезжать к нам.`, correctText: `Мой совет: обвенчаться<span class="highlightText">&nbsp;</span>как можно скорее<span class="highlightText">&nbsp;</span>в вашей деревянной церкви и приезжать к нам.`, buttons: [{name: 'Запятая нужна, это сложное предложение', ruleInfo: `Наречные выражения «как можно скорее (...больше, выше)» не выделяются запятой.`, needed: false}, { name: 'Без запятой, это наречное выражение',  ruleInfo: `Наречные выражения «как можно скорее (...больше, выше)» не выделяются запятой.`, needed: true}], helpMessage: 'Наречные выражения «как можно скорее (...больше, выше)» не выделяются запятыми.', author: `А.С. Пушкин
«Роман в письмах»`}
, {id: 17, questionText: `Я не корчу английского лорда<span class="highlightText">&nbsp;?&nbsp;</span>как дипломат Северин, внук портного и повара.`, correctText: `Я не корчу английского лорда<span class="highlightText">,&nbsp;</span>как дипломат Северин, внук портного и повара.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Это сравнение, выделяется запятыми.`, needed: true}, { name: 'Без запятой, значение причины',  ruleInfo: `Это сравнение, выделяется запятыми.`, needed: false}], helpMessage: 'Автор письма сравнивает себя с дипломатом Севериным.', author: `А.С. Пушкин
«Роман в письмах»`}
, {id: 18, questionText: `Сотни верст пустынной, однообразной, выгоревшей степи не могут нагнать такого уныния<span class="highlightText">&nbsp;?&nbsp;</span>как один человек, когда он сидит, говорит и неизвестно, когда он уйдет.`, correctText: `Сотни верст пустынной, однообразной, выгоревшей степи не могут нагнать такого уныния<span class="highlightText">,&nbsp;</span>как один человек, когда он сидит, говорит и неизвестно, когда он уйдет.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Это сравнение, выделяется запятыми.`, needed: true}, { name: 'Без запятой, «как один» не выделяется',  ruleInfo: `Запятая нужна: «как один» входит в состав сравнения. Сравните: «Все работали как один».`, needed: false}], helpMessage: 'Автор сравнивает скучного человека с пустыней.', author: `А.П. Чехов
«Дом с мезонином»`}
, {id: 19, questionText: `Да, всё он делал не<span class="highlightText">&nbsp;?&nbsp;</span>как люди.`, correctText: `Да, всё он делал не<span class="highlightText">&nbsp;</span>как люди.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Запятая не ставится, еслт перед «как» стоит частица «не».`, needed: false}, { name: 'Без запятой, есть частица «не»',  ruleInfo: `Запятая не ставится, если перед «как» стоит частица «не».`, needed: true}], helpMessage: 'Даже тире между подлежащим и сказуемым не ставится, если есть частица «не».', author: `Максим Горький
«Исповедь»`}
, {id: 20, questionText: `По мнению здешних ученых, этот провал не что иное<span class="highlightText">&nbsp;?&nbsp;</span>как угасший кратер.`, correctText: `По мнению здешних ученых, этот провал не что иное<span class="highlightText">,&nbsp;</span>как угасший кратер.`, buttons: [{name: 'Запятая всегда нужна в такой конструкции', ruleInfo: `Обороты «не что иное, как», «не кто другой, как» всегда выделяются запятыми.`, needed: true}, { name: 'Без запятой. «Не что иное как» не требует запятых',  ruleInfo: `Запятая нужна, потому что обороты «не что иное, как», «не кто другой, как» всегда выделяются запятыми.`, needed: false}], helpMessage: 'Это написал не кто иной, как Лермонтов.', author: `М.Ю. Лермонтов
«Герой нашего времени»`}
, {id: 21, questionText: `Честолюбие есть не что иное<span class="highlightText">&nbsp;?&nbsp;</span>как жажда власти.`, correctText: `Честолюбие есть не что иное<span class="highlightText">,&nbsp;</span>как жажда власти.`, buttons: [{name: 'Запятая всегда нужна в такой конструкции', ruleInfo: `Обороты «не что иное, как», «не кто другой, как» всегда выделяются запятыми.`, needed: true}, { name: 'Без запятой. «Не что иное как» не требует запятых',  ruleInfo: `Запятая нужна, потому что обороты «не что иное, как», «не кто другой, как» всегда выделяются запятыми.`, needed: false}], helpMessage: 'Это написал не кто иной, как Лермонтов.', author: `М.Ю. Лермонтов
«Герой нашего времени»`}
, {id: 22, questionText: `Гость был не кто другой<span class="highlightText">&nbsp;?&nbsp;</span>как наш почтенный Павел Иванович Чичиков.`, correctText: `Гость был не кто другой<span class="highlightText">,&nbsp;</span>как наш почтенный Павел Иванович Чичиков.`, buttons: [{name: 'Запятая всегда нужна в такой конструкции', ruleInfo: `Обороты «не что иное, как» «не кто другой, как» всегда выделяются запятыми.`, needed: true}, { name: 'Без запятой. «Не кто другой как» не требует запятых',  ruleInfo: `Запятая нужна, потому что обороты «не что иное, как» «не кто другой, как» всегда выделяются запятыми.`, needed: false}], helpMessage: 'Это написал не кто другой, как Гоголь.', author: `Н.В. Гоголь
«Мёртвые души»`}
, {id: 23, questionText: `Она была<span class="highlightText">&nbsp;?&nbsp;</span>как меньшая<span class="highlightText">&nbsp;?&nbsp;</span>любимица отца.`, correctText: `Она была<span class="highlightText">,&nbsp;</span>как меньшая<span class="highlightText">,&nbsp;</span>любимица отца.`, buttons: [{name: 'Запятая нужна, значение причины', ruleInfo: `Запятая ставится, если оборот с «как» означает причину.`, needed: true}, { name: 'Без запятой, значение приравнивания',  ruleInfo: `Запятая ставится, если оборот с «как» означает причину. Проверка: замените «как» на «будучи», смысл сохранится.`, needed: false}], helpMessage: 'Она была любимицей, потому что младшая.', author: `Л.Н. Толстой
«Анна Каренина»`}
, {id: 24, questionText: `Наш сад<span class="highlightText">&nbsp;?&nbsp;</span>как проходной двор.`, correctText: `Наш сад<span class="highlightText">&nbsp;</span>как проходной двор.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Запятая не ставится, если оборот с «как» входит в состав сказуемого.`, needed: false}, { name: 'Без запятой, это часть сказуемого',  ruleInfo: `Запятая ставится, если оборот с «как» входит в состав сказуемого. Обычно так бывает в предложениях без глаголов или с глаголами «был», «стал» и т.п.`, needed: true}], helpMessage: 'Есть ли глагол в этом предложении?', author: `А.П. Чехов
«Вишнёвый сад»`}
, {id: 25, questionText: `Богат, хорош собою, Ленский<br />
Везде был принят<span class="highlightText">&nbsp;?&nbsp;</span>как жених.`, correctText: `Богат, хорош собою, Ленский<br />
Везде был принят<span class="highlightText">&nbsp;</span>как жених.`, buttons: [{name: 'Запятая нужна, значение причины', ruleInfo: `Запятая не ставится, если «как» можно заменить на «в качестве»`, needed: false}, { name: 'Без запятой, значение «в качестве»',  ruleInfo: `Запятая не ставится, если «как» можно заменить на «в качестве»`, needed: true}], helpMessage: 'Ленский везде был принят в качестве жениха.', author: `А.С. Пушкин
«Евгений Онегин»`}
, {id: 26, questionText: `Вас это<span class="highlightText">&nbsp;?&nbsp;</span>как будто<span class="highlightText">&nbsp;?&nbsp;</span>удивляет.`, correctText: `Вас это<span class="highlightText">&nbsp;</span>как будто<span class="highlightText">&nbsp;</span>удивляет.`, buttons: [{name: 'Запятая нужна, это вводное словосочетание.', ruleInfo: `Частица «как будто» никогда не выделяется запятыми.`, needed: false}, { name: 'Без запятой, это частица.',  ruleInfo: `Частица «как будто» никогда не выделяется запятыми.`, needed: true}], helpMessage: 'Частицы «как будто», «словно» не выделяются запятыми.', author: `И.С. Тургенев
«Отцы и дети»`}
, {id: 27, questionText: `И хотя этот зуб принадлежал к числу обыкновенных, однако Василий Иванович сохранил его<span class="highlightText">&nbsp;?&nbsp;</span>как редкость.`, correctText: `И хотя этот зуб принадлежал к числу обыкновенных, однако Василий Иванович сохранил его<span class="highlightText">&nbsp;</span>как редкость.`, buttons: [{name: 'Запятая нужна, значение причины', ruleInfo: `Запятая не ставится, если «как» можно заменить на «в качестве».`, needed: false}, { name: 'Без запятой, значение «в качестве»',  ruleInfo: `Запятая не ставится, если «как» можно заменить на «в качестве».`, needed: true}], helpMessage: 'Он сохранил зуб не в качестве анатомического образца, а в качестве редкости. ', author: `И.С. Тургенев
«Отцы и дети»`}
, {id: 28, questionText: `Я сейчас вспомнил, что я еще не попросил у вас<span class="highlightText">&nbsp;?&nbsp;</span>как следует<span class="highlightText">&nbsp;?&nbsp;</span>прощения.`, correctText: `Я сейчас вспомнил, что я еще не попросил у вас<span class="highlightText">&nbsp;</span>как следует<span class="highlightText">&nbsp;</span>прощения.`, buttons: [{name: 'Запятая нужна, это вводное словосочетание', ruleInfo: `Устойчивое сочетание «как следует» никогда не выделяется запятой.`, needed: false}, { name: 'Без запятой, устойчивое сочетание',  ruleInfo: `Устойчивое сочетание «как следует» никогда не выделяется запятой. Для проверки можно заменить на «хорошенько», «в полной мере».`, needed: true}], helpMessage: 'Я ещё не попросил у вас прощения в полной мере.', author: `И.С. Тургенев
«Накануне»`}
, {id: 29, questionText: `Я посмотрел на нее<span class="highlightText">&nbsp;?&nbsp;</span>как дурак — и вышел вон.`, correctText: `Я посмотрел на нее<span class="highlightText">&nbsp;</span>как дурак — и вышел вон.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Запятая не нужна, это устойчивое сочетание со значением обстоятельства.`, needed: false}, { name: 'Без запятой, устойчивое сочетание',  ruleInfo: `Запятая не нужна, это устойчивое сочетание со значением обстоятельства. Проверка: можно заменить одним словом: «глупо смотрел».`, needed: true}], helpMessage: 'Я посмотрел на неё глупо — и вышел.', author: `И.С. Тургенев
«Ася»`}
, {id: 30, questionText: `Старайтесь смотреть на меня<span class="highlightText">&nbsp;?&nbsp;</span>как на пациента, одержимого болезнью, вам ещё неизвестной.`, correctText: `Старайтесь смотреть на меня<span class="highlightText">&nbsp;</span>как на пациента, одержимого болезнью, вам ещё неизвестной.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Запятая не нужна, «как» в значении «в качестве»: «воспринимайте меня в качестве пациента».`, needed: false}, { name: 'Без запятой, значение «в качестве»',  ruleInfo: `Запятая не нужна, «как» в значении «в качестве». Проверка: «воспринимайте меня в качестве пациента».`, needed: true}], helpMessage: '«Как» в значении «в качестве» используют, когда хотят подчеркнуть одну сторону объекта: «Воспринимайте меня только в качестве пациента». ', author: `М. Ю. Лермонтов
«Герой нашего времени»`}
, {id: 31, questionText: `Вижу<span class="highlightText">&nbsp;?&nbsp;</span>как теперь<span class="highlightText">&nbsp;?&nbsp;</span>самого хозяина, человека лет пятидесяти, свежего и бодрого.`, correctText: `Вижу<span class="highlightText">,&nbsp;</span>как теперь<span class="highlightText">,&nbsp;</span>самого хозяина, человека лет пятидесяти, свежего и бодрого.`, buttons: [{name: 'Запятая нужна, устойчивое сочетание', ruleInfo: `Запятыми выделяются устойчивые сочетания «как теперь», «как всегда» и т.п.`, needed: true}, { name: 'Без запятой, надо запомнить',  ruleInfo: `Запятыми выделяются устойчивые сочетания «как теперь», «как всегда» и т.п.`, needed: false}], helpMessage: '«Как теперь», «как нарочно», «как назло» и другие устойчивые сочетания выделяются запятыми.', author: `А.С. Пушкин
«Станционный смотритель»`}
, {id: 32, questionText: `Экая досада! Как нарочно<span class="highlightText">&nbsp;?&nbsp;</span>ни души!`, correctText: `Экая досада! Как нарочно<span class="highlightText">,&nbsp;</span>ни души!`, buttons: [{name: 'Запятая нужна, устойчивое сочетание', ruleInfo: `Запятыми выделяются устойчивые сочетания «как теперь», «как всегда» и т.п.`, needed: true}, { name: 'Без запятой, надо запомнить',  ruleInfo: `Запятыми выделяются устойчивые сочетания «как теперь», «как всегда» и т.п.`, needed: false}], helpMessage: '«Как теперь», «как нарочно», «как назло» и другие устойчивые сочетания выделяются запятыми.', author: `Н.В. Гоголь
«Ревизор»`}
, {id: 33, questionText: `Нигде при взаимной встрече не раскланиваются так благородно и непринуждённо<span class="highlightText">&nbsp;?&nbsp;</span>как на Невском проспекте.`, correctText: `Нигде при взаимной встрече не раскланиваются так благородно и непринуждённо<span class="highlightText">,&nbsp;</span>как на Невском проспекте.`, buttons: [{name: 'Запятая всегда нужна в такой конструкции', ruleInfo: `Запятой всегда разделяются «так», «такой» и «как», если между ними есть другие слова.`, needed: true}, { name: 'Без запятой, есть «так»',  ruleInfo: `Запятой всегда разделяются «так», «такой» и «как», если между ними есть другие слова.`, needed: false}], helpMessage: 'Если есть слова «такой», «так», запятая нужна. ', author: `Н.В. Гоголь
«Невский проспект»`}
, {id: 34, questionText: `Герасиму<span class="highlightText">&nbsp;?&nbsp;</span>как отличному работнику<span class="highlightText">&nbsp;?&nbsp;</span>тут же дали метлу в руки.`, correctText: `Герасиму<span class="highlightText">,&nbsp;</span>как отличному работнику<span class="highlightText">,&nbsp;</span>тут же дали метлу в руки.`, buttons: [{name: 'Запятая нужна, значение причины', ruleInfo: `Запятая нужна, потому что оборот с «как» имеет значение причины.`, needed: true}, { name: 'Без запятой, значение «в качестве»',  ruleInfo: `
Запятая нужна, потому что оборот с «как» имеет значение причины. Сравните: «Герасиму дали метлу, потому что он был отличным работником».`, needed: false}], helpMessage: 'Герасиму дали метлу, потому что он был отличным работником.', author: `И.С. Тургенев
«Муму»`}
, {id: 35, questionText: `Чуть утро осветило пушки,<br />
И леса синие верхушки,<br />
Французы тут<span class="highlightText">&nbsp;?&nbsp;</span>как тут.`, correctText: `Чуть утро осветило пушки,<br />
И леса синие верхушки,<br />
Французы тут<span class="highlightText">&nbsp;</span>как тут.`, buttons: [{name: 'Запятая нужна, фразеологизм.', ruleInfo: `Запятая не нужна, потому что «тут как тут» — сказуемое. Между подлежащим и сказуемым запятой быть не может.`, needed: false}, { name: 'Запятая не нужна, это сказуемое.',  ruleInfo: `Запятая не нужна, потому что «тут как тут» — сказуемое. Между подлежащим и сказуемым запятой быть не может.`, needed: true}], helpMessage: 'Фразеологизм «тут как тут» означает «появились», это сказуемое.', author: `М.Ю. Лермонтов
«Бородино»`}
, {id: 36, questionText: `Как истинный француз<span class="highlightText">&nbsp;?&nbsp;</span>в кармане<br />
Трике привез куплет Татьяне.`, correctText: `Как истинный француз<span class="highlightText">,&nbsp;</span>в кармане<br />
Трике привез куплет Татьяне.`, buttons: [{name: 'Запятая нужна, значение причины.', ruleInfo: `Запятая нужна, потому что оборот с «как» имеет значение причины.`, needed: true}, { name: 'Без запятой, это часть сказуемого.',  ruleInfo: `Запятая нужна, потому что оборот с «как» имеет значение причины. Проверка: «Он привёз куплет, потому что был французом».`, needed: false}], helpMessage: 'Трике привёз куплет, потому что был истинным французом и имел хорошие манеры', author: `А.С. Пушкин
«Евгений Онегин»`}
, {id: 37, questionText: `Если, по-твоему, всё это артисты, то я не знаю<span class="highlightText">&nbsp;?&nbsp;</span>как и говорить с тобой. Разве это актеры? Самые настоящие посредственности!`, correctText: `Если, по-твоему, всё это артисты, то я не знаю<span class="highlightText">,&nbsp;</span>как и говорить с тобой. Разве это актеры? Самые настоящие посредственности!`, buttons: [{name: 'Запятая нужна, сложное предложение', ruleInfo: `Запятая нужна, союз «как» соединяет две части сложного предложения.`, needed: true}, { name: 'Без запятой, устойчивое сочетание «не знаю как»',  ruleInfo: `Запятая нужна, союз «как» соединяет две части сложного предложения. Подсказка: перед «как и» всегда ставится запятая.`, needed: false}], helpMessage: 'Перед «как и» всегда ставится запятая.', author: `А.П. Чехов
«Критик»`}
, {id: 38, questionText: `Старый князь<span class="highlightText">&nbsp;?&nbsp;</span>как и все отцы<span class="highlightText">&nbsp;?&nbsp;</span>был особенно щепетилен насчет чести своих дочерей.`, correctText: `Старый князь<span class="highlightText">,&nbsp;</span>как и все отцы<span class="highlightText">,&nbsp;</span>был особенно щепетилен насчет чести своих дочерей.`, buttons: [{name: 'Запятая нужна, сложное предложение', ruleInfo: `Запятая нужна, союз «как» соединяет две части сложного предложения.`, needed: true}, { name: 'Без запятой, часть сказуемого',  ruleInfo: `Запятая нужна, союз «как» соединяет две части сложного предложения. Подсказка: перед «как и» всегда ставится запятая.`, needed: false}], helpMessage: 'Перед «как и» всегда ставится запятая.', author: `Л.Н. Толстой
«Анна Каренина»`}
, {id: 39, questionText: `А коли узнаю, что ты повел себя не<span class="highlightText">&nbsp;?&nbsp;</span>как сын Николая Болконского, мне будет… стыдно!`, correctText: `А коли узнаю, что ты повел себя не<span class="highlightText">&nbsp;</span>как сын Николая Болконского, мне будет… стыдно!`, buttons: [{name: 'Запятая нужна, сравнение', ruleInfo: `Запятая не нужна, если есть частица «не» или слова «почти», «совершенно», «точь-в-точь».`, needed: false}, { name: 'Запятая не нужна, есть частица «не»',  ruleInfo: `Запятая не нужна, если есть частица «не» или слова «почти», «совершенно», «точь-в-точь».`, needed: true}], helpMessage: 'Когда есть частица «не», не ставится даже тире между подлежащим и сказуемым.', author: `Л.Н. Толстой
«Война и мир»`}
, {id: 40, questionText: `Князь Андрей бывал каждый день у Ростовых, но не<span class="highlightText">&nbsp;?&nbsp;</span>как жених<span class="highlightText">&nbsp;?&nbsp;</span>обращался с Наташей.`, correctText: `Князь Андрей бывал каждый день у Ростовых, но не<span class="highlightText">&nbsp;</span>как жених<span class="highlightText">&nbsp;</span>обращался с Наташей.`, buttons: [{name: 'Запятая нужна, значение причины', ruleInfo: `Запятая не нужна, если есть частица «не» или слова «почти», «совершенно», «точь-в-точь».`, needed: false}, { name: 'Запятая не нужна, есть частица «не»',  ruleInfo: `Запятая не нужна, если есть частица «не» или слова «почти», «совершенно», «точь-в-точь».`, needed: true}], helpMessage: 'Когда есть частица «не», не ставится даже тире между подлежащим и сказуемым.', author: `Л.Н. Толстой
«Война и мир»`}
, {id: 41, questionText: `Он почти<span class="highlightText">&nbsp;?&nbsp;</span>как ребенок, впрочем образованный`, correctText: `Он почти<span class="highlightText">&nbsp;</span>как ребенок, впрочем образованный`, buttons: [{name: 'Запятая нужна, сравнение', ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «совершенно».`, needed: false}, { name: 'Запятая не нужна, есть «почти»',  ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «совершенно».`, needed: true}], helpMessage: 'Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «прямо».', author: `Ф.М. Достоевский
«Идиот»`}
, {id: 42, questionText: `После того<span class="highlightText">&nbsp;?&nbsp;</span>как Егорушка убежал от костра, они сначала долго молчали.`, correctText: `После того<span class="highlightText">&nbsp;</span>как Егорушка убежал от костра, они сначала долго молчали.`, buttons: [{name: 'Запятая нужна, это сложное предложение', ruleInfo: `Запятая не нужна, потому что сложный союз «после того как» стоит в начале предложения.`, needed: false}, { name: 'Без запятой, это сложный союз',  ruleInfo: `Запятая не нужна, потому что сложный союз «после того как» стоит в начале предложения.`, needed: true}], helpMessage: 'Внутри сложных союзов «с тех пор как», «после того как» не нужна запятая, если они стоят в начале предложения.', author: `А.П. Чехов
«Степь»`}
, {id: 43, questionText: `Он был среди граждан совершенно<span class="highlightText">&nbsp;?&nbsp;</span>как в родной семье, а в лавки и в гостиный двор наведывался, как в собственную кладовую.`, correctText: `Он был среди граждан совершенно<span class="highlightText">&nbsp;</span>как в родной семье, а в лавки и в гостиный двор наведывался, как в собственную кладовую.`, buttons: [{name: 'Запятая нужна, сравнение', ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «совершенно».`, needed: false}, { name: 'Запятая не нужна, есть «совершенно»',  ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «совершенно».`, needed: true}], helpMessage: 'Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «совершенно».', author: `Н.В. Гоголь
«Мёртвые души»`}
, {id: 44, questionText: `Ему помогали воспоминания его театральной карьеры — и он разыгрывал роль секунданта именно<span class="highlightText">&nbsp;?&nbsp;</span>как роль.`, correctText: `Ему помогали воспоминания его театральной карьеры — и он разыгрывал роль секунданта именно<span class="highlightText">&nbsp;</span>как роль.`, buttons: [{name: 'Запятая нужна, сравнение', ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «именно».`, needed: false}, { name: 'Запятая не нужна, есть «именно»',  ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «именно».`, needed: true}], helpMessage: 'Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «вроде».', author: `И.С. Тургенев
«Вешние воды»`}
, {id: 45, questionText: `Жена – друг, ежели правильно вникнуть в дело. Она к тебе вроде<span class="highlightText">&nbsp;?&nbsp;</span>как цепью<span class="highlightText">&nbsp;?&nbsp;</span>на всю жизнь прикована.`, correctText: `Жена – друг, ежели правильно вникнуть в дело. Она к тебе вроде<span class="highlightText">&nbsp;</span>как цепью<span class="highlightText">&nbsp;</span>на всю жизнь прикована.`, buttons: [{name: 'Запятая нужна, сравнение', ruleInfo: `Запятая не нужна, если перед «как» стоят слова «вроде», «совсем», «именно».`, needed: false}, { name: 'Запятая не нужна, есть «вроде»',  ruleInfo: `Запятая не нужна, если перед «как» стоят слова «вроде», «совсем», «именно».`, needed: true}], helpMessage: 'Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «именно».', author: `Максим Горький
«Бывшие люди»`}
, {id: 46, questionText: `Можешь ли ты нарисовать такой портрет, чтобы был совершенно<span class="highlightText">&nbsp;?&nbsp;</span>как живой?`, correctText: `Можешь ли ты нарисовать такой портрет, чтобы был совершенно<span class="highlightText">&nbsp;</span>как живой?`, buttons: [{name: 'Запятая нужна, сравнение', ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «совершенно».`, needed: false}, { name: 'Запятая не нужна, есть «совершенно»',  ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «совершенно».`, needed: true}], helpMessage: 'Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «прямо».', author: `Н.В. Гоголь
«Портрет»`}
, {id: 47, questionText: `Обшивка его была, правда, немного повреждена, но все же это был прекрасный стул и к тому же точь-в-точь<span class="highlightText">&nbsp;?&nbsp;</span>как первый.`, correctText: `Обшивка его была, правда, немного повреждена, но все же это был прекрасный стул и к тому же точь-в-точь<span class="highlightText">&nbsp;</span>как первый.`, buttons: [{name: 'Запятая нужна, сравнение', ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «точь-в-точь», «совершенно».`, needed: false}, { name: 'Запятая не нужна, есть «точь-в-точь»',  ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «точь-в-точь», «совершенно».`, needed: true}], helpMessage: 'Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «прямо».', author: `Илья Ильф, Евгений Петров
«Двенадцать стульев»`}
, {id: 48, questionText: `Но эта история ничто в сравнении с рассказом о молодости<span class="highlightText">&nbsp;?&nbsp;</span>как таковой.`, correctText: `Но эта история ничто в сравнении с рассказом о молодости<span class="highlightText">&nbsp;</span>как таковой.`, buttons: [{name: 'Запятая нужна, уточняющий оборот', ruleInfo: `Запятая не ставится в местоименном обороте «как таковой».`, needed: false}, { name: 'Без запятой, местоименный оборот ',  ruleInfo: `Запятая не ставится в местоименном обороте «как таковой».`, needed: true}], helpMessage: 'Но эта история ничего в сравнении с рассказом о молодости самой по себе.', author: `Илья Ильф, Евгений Петров
«Преступление Якова»`}
, {id: 49, questionText: `Цензорам представляли не рукопись<span class="highlightText">&nbsp;?&nbsp;</span>как таковую, а машинописный экземпляр, чтоб удобнее было читать и вносить правку.`, correctText: `Цензорам представляли не рукопись<span class="highlightText">&nbsp;</span>как таковую, а машинописный экземпляр, чтоб удобнее было читать и вносить правку.`, buttons: [{name: 'Запятая нужна, уточняющий оборот', ruleInfo: `Запятая не ставится в местоименном обороте «как таковой».`, needed: false}, { name: 'Без запятой, местоименный оборот ',  ruleInfo: `Запятая не ставится в местоименном обороте «как таковой».`, needed: true}], helpMessage: 'Цензорам предоставляли не рукопись саму по себе, а машинописный экземпляр.', author: `Илья Ильф, Евгений Петров
«Золотой телёнок»`}
, {id: 50, questionText: `С тех пор<span class="highlightText">&nbsp;?&nbsp;</span>как вечный судия<br />
Мне дал всеведенье пророка,<br />
В очах людей читаю я<br />
Страницы злобы и порока.`, correctText: `С тех пор<span class="highlightText">&nbsp;</span>как вечный судия
Мне дал всеведенье пророка,
В очах людей читаю я
Страницы злобы и порока.`, buttons: [{name: 'Запятая нужна, это сложное предложение', ruleInfo: `Запятая не нужна, потому что сложный союз «после того как» стоит в начале предложения.`, needed: false}, { name: 'Без запятой, это сложный союз',  ruleInfo: `Запятая не нужна, потому что сложный союз «после того как» стоит в начале предложения.`, needed: true}], helpMessage: 'Внутри сложных союзов «с тех пор как», «после того как» не нужна запятая, если они стоят в начале предложения.', author: `М.Ю. Лермонтов
«Пророк»`}
    ];

    const timerQuestions = [
       {id: 1, questionText: `Марья Гавриловна была воспитана на французских романах и<span class="highlightText">&nbsp;?&nbsp;</span>следственно<span class="highlightText">&nbsp;?&nbsp;</span>была влюблена.`, correctText: `Марья Гавриловна была воспитана на французских романах и<span class="highlightText">,&nbsp;</span>следственно<span class="highlightText">,&nbsp;</span>была влюблена.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводное слово означает порядок мыслей и выделяется запятыми.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Вводное слово означает порядок мыслей и выделяется запятыми.`, needed: false}], author: `А.С. Пушкин
«Метель»`}
, {id: 2, questionText: `Тебя тоской преследовать не буду,<br />
Прошедшее<span class="highlightText">&nbsp;?&nbsp;</span>быть может<span class="highlightText">&nbsp;?&nbsp;</span>позабуду&nbsp;—<br />
Не для меня сотворена любовь.`, correctText: `Тебя тоской преследовать не буду,<br />
Прошедшее<span class="highlightText">,&nbsp;</span>быть может<span class="highlightText">,&nbsp;</span>позабуду&nbsp;—<br />
Не для меня сотворена любовь.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводное словосочетание выражает неуверенность говорящего и выделяется запятыми.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Вводное словосочетание выражает неуверенность говорящего и выделяется запятыми.`, needed: false}], author: `А.С. Пушкин
«Всё кончено: меж нами связи нет...»`}
, {id: 3, questionText: `Ты прав: что<span class="highlightText">&nbsp;?&nbsp;</span>может быть<span class="highlightText">&nbsp;?&nbsp;</span>важней<br />
На свете женщины прекрасной?`, correctText: `Ты прав: что<span class="highlightText">&nbsp;?&nbsp;</span>может быть<span class="highlightText">&nbsp;?&nbsp;</span>важней<br />
На свете женщины прекрасной?`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятые не нужны, так как «может быть» — часть сказуемого.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятые не нужны, так как «может быть» — часть сказуемого, а не вводное. Проверка: нельзя выбросить из предложения без потери смысла.`, needed: true}], author: `А.С. Пушкин
«К Родзянке»`}
, {id: 4, questionText: `Старушка сидела<span class="highlightText">&nbsp;?&nbsp;</span>однажды<span class="highlightText">&nbsp;?&nbsp;</span>одна в гостиной, раскладывая гран-пасьянс.`, correctText: `Старушка сидела<span class="highlightText">&nbsp;?&nbsp;</span>однажды<span class="highlightText">&nbsp;?&nbsp;</span>одна в гостиной, раскладывая гран-пасьянс.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятые не нужны, наречие «однажды» — обстоятельство, а не вводное слово.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, наречие «однажды» — обстоятельство, а не вводное слово.`, needed: true}], author: `А.С. Пушкин
«Метель»`}
, {id: 5, questionText: `Вот<span class="highlightText">&nbsp;?&nbsp;</span>какими путями распространяется просвещение!`, correctText: `Вот<span class="highlightText">&nbsp;?&nbsp;</span>какими путями распространяется просвещение!`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, потому что «вот» — это указательная частица.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, потому что «вот» — это указательная частица.`, needed: true}], author: `А.С. Пушкин
«Барышня-крестьянка»`}
, {id: 6, questionText: `Пили по обыкновенному, то есть<span class="highlightText">&nbsp;?&nbsp;</span>очень много.`, correctText: `Пили по обыкновенному, то есть<span class="highlightText">&nbsp;?&nbsp;</span>очень много.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, так как «то есть» — это союз.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, так как «то есть» — это союз.`, needed: true}], author: `А.С. Пушкин
«Выстрел»`}
, {id: 7, questionText: `Не понимаю, каким образом можно свататься, если знаешь<span class="highlightText">&nbsp;?&nbsp;</span>наверно, что не будет отказа.`, correctText: `Не понимаю, каким образом можно свататься, если знаешь<span class="highlightText">&nbsp;?&nbsp;</span>наверно, что не будет отказа.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, потому что «наверно» — обстоятельство.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, потому что «наверно» — обстоятельство. «Знаешь (как?) наверное».`, needed: true}], author: `А.С. Пушкин
из перевода «Участь моя решена»`}
, {id: 8, questionText: `Ах если б вас могла я ненавидеть!<br />
Однако ж<span class="highlightText">&nbsp;?&nbsp;</span>надобно расстаться нам.`, correctText: `Ах если б вас могла я ненавидеть!<br />
Однако ж<span class="highlightText">&nbsp;?&nbsp;</span>надобно расстаться нам.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, потому что здесь «однако» — союз, а не вводное слово.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, потому что здесь «однако» — союз, а не вводное слово. Проверка: можно заменить союзом «но».`, needed: true}], author: `А.С. Пушкин
«Каменный гость»`}
, {id: 9, questionText: `Жизнь его<span class="highlightText">&nbsp;?&nbsp;</span>наконец<span class="highlightText">&nbsp;?&nbsp;</span>была в моих руках.`, correctText: `Жизнь его<span class="highlightText">&nbsp;?&nbsp;</span>наконец<span class="highlightText">&nbsp;?&nbsp;</span>была в моих руках.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна.«Наконец» может быть наречием, союзом или вводным словом. Здесь — наречие.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна.«Наконец» может быть наречием, союзом или вводным словом. Здесь — наречие.`, needed: true}], author: `А.С. Пушкин
«Выстрел»`}
, {id: 10, questionText: `Между тем<span class="highlightText">&nbsp;?&nbsp;</span>я стал ходить взад и вперед, осматривая книги и картины.`, correctText: `Между тем<span class="highlightText">&nbsp;</span>я стал ходить взад и вперед, осматривая книги и картины.`, buttons: [{name: 'Нужны запятые', ruleInfo: `«Между тем» может быть наречием и союзом, но не может быть вводным словом. Запятыми не выделяется.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Неверно.
«Между тем» может быть наречием и союзом, но не может быть вводным словом. Запятыми не выделяется.`, needed: true}], author: `А.С. Пушкин
«Выстрел»`}
, {id: 11, questionText: `Бывало<span class="highlightText">&nbsp;?&nbsp;</span>кто ни проедет, всякий похвалит, никто не осудит.`, correctText: `Бывало<span class="highlightText">,&nbsp;</span>кто ни проедет, всякий похвалит, никто не осудит.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводное слово «бывало» означает оценку обычности того, о чём говорят.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна. Вводное слово «бывало» означает оценку обычности того, о чём говорят.`, needed: false}], author: `А.С. Пушкин
«Станционный смотритель»`}
, {id: 12, questionText: `Этот человек в футляре<span class="highlightText">&nbsp;?&nbsp;</span>можете себе представить<span class="highlightText">&nbsp;?&nbsp;</span>едва не женился.`, correctText: `Этот человек в футляре<span class="highlightText">,&nbsp;</span>можете себе представить<span class="highlightText">,&nbsp;</span>едва не женился.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводная конструкция «можете себе представить» помогает привлечь внимание собеседника.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `«Можете себе представить» — вводная конструкция, помогает привлечь внимание собеседника. Запятые нужны.`, needed: false}], author: `А.П. Чехов
«Человек в футляре»`}
, {id: 13, questionText: `Действительно<span class="highlightText">&nbsp;?&nbsp;</span>я занимала его, и ему было весело смотреть на мой смех.`, correctText: `Действительно<span class="highlightText">,&nbsp;</span>я занимала его, и ему было весело смотреть на мой смех.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая нужна, потому что здесь «действительно» — вводное слово.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна, потому что здесь «действительно» — вводное слово. Проверка: стоит в начале предложения, можно выбросить без потери смысла.`, needed: false}], author: `Ф.М. Достоевский
«Неточка Незванова»`}
, {id: 14, questionText: `Однако долг<span class="highlightText">&nbsp;?&nbsp;</span>вы понимаете<span class="highlightText">&nbsp;?&nbsp;</span>прежде всего.`, correctText: `Однако долг<span class="highlightText">,&nbsp;</span>вы понимаете<span class="highlightText">,&nbsp;</span>прежде всего.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводная конструкция «вы понимаете» помогает привлечь внимание собеседника.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Вводная конструкция «вы понимаете» выделяется запятыми, помогает привлечь внимание собеседника.`, needed: false}], author: `И.С. Тургенев
«Уездный лекарь»`}
, {id: 15, questionText: `В чем счастие<span class="highlightText">&nbsp;?&nbsp;</span>по-вашему?`, correctText: `В чем счастие<span class="highlightText">,&nbsp;</span>по-вашему?`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводное слово «по-вашему» выражает источник сообщения.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна, потому что «по-вашему» — вводное слово, называет источник сообщения`, needed: false}], author: `Н.А. Некрасов
«Кому на Руси жить хорошо»`}
, {id: 16, questionText: `Я<span class="highlightText">&nbsp;?&nbsp;</span>признаюсь<span class="highlightText">&nbsp;?&nbsp;</span>не&nbsp;смел поднять очей.`, correctText: `Я<span class="highlightText">,&nbsp;</span>признаюсь<span class="highlightText">,&nbsp;</span>не смел поднять очей.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятыми выделяются вводные «признаюсь», «по совести», «смешно сказать».`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятыми выделяются вводные «признаюсь», «по совести», «смешно сказать».`, needed: false}], author: `А.С. Пушкин
«Борис Годунов»`}
, {id: 17, questionText: `Ради бога<span class="highlightText">&nbsp;?&nbsp;</span>дай мне руку: я тону.`, correctText: `Ради бога<span class="highlightText">,&nbsp;</span>дай мне руку: я тону.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводное словосочетание «ради бога» выделяется запятыми.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Вводное словосочетание «ради бога» выделяется запятыми.`, needed: false}], author: `А.С. Пушкин
«Роман в письмах»`}
, {id: 18, questionText: `Поступок твоего рыцаря меня тронул<span class="highlightText">&nbsp;?&nbsp;</span>кроме шуток.`, correctText: `Поступок твоего рыцаря меня тронул<span class="highlightText">,&nbsp;</span>кроме шуток.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводные словосочетания «кроме шуток», «по сути», «правду сказать» выделяются запятыми.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Вводные словосочетания «кроме шуток», «по сути», «правду сказать» выделяются запятыми.`, needed: false}], author: `А.С. Пушкин
«Роман в письмах»`}
, {id: 19, questionText: `Легкомысленно непроницательны люди, и человек в другом кафтане<span class="highlightText">&nbsp;?&nbsp;</span>кажется им<span class="highlightText">&nbsp;?&nbsp;</span>другим человеком.`, correctText: `Легкомысленно непроницательны люди, и человек в другом кафтане<span class="highlightText">&nbsp;?&nbsp;</span>кажется им<span class="highlightText">&nbsp;?&nbsp;</span>другим человеком.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, так как это сказуемое с дополнением.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, потому что «кажется» — сказуемое.`, needed: true}], author: `Н.В. Гоголь
«Мёртвые души»`}
, {id: 20, questionText: `Ручаюсь вам если не за триумф, то<span class="highlightText">&nbsp;?&nbsp;</span>по крайней мере<span class="highlightText">&nbsp;?&nbsp;</span>за барыш...`, correctText: `Ручаюсь вам если не за триумф, то<span class="highlightText">&nbsp;?&nbsp;</span>по крайней мере<span class="highlightText">&nbsp;?&nbsp;</span>за барыш...`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, когда словосочетание «по крайней мере» можно заменить на «минимум», «не меньше, чем».`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, когда словосочетание «по крайней мере» можно заменить на «минимум», «не меньше, чем».`, needed: true}], author: `А.С. Пушкин
«Египетские ночи»`}
, {id: 21, questionText: `Вам до меня<span class="highlightText">&nbsp;?&nbsp;</span>конечно<span class="highlightText">&nbsp;?&nbsp;</span>нет никакого дела.`, correctText: `Вам до меня<span class="highlightText">,&nbsp;</span>конечно<span class="highlightText">,&nbsp;</span>нет никакого дела.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая нужна, «конечно» — вводное слово.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна, «конечно» всегда выделяется запятой.`, needed: false}], author: `А.Н. Толстой
«Хождение по мукам»`}
, {id: 22, questionText: `Героиней этого романа<span class="highlightText">&nbsp;?&nbsp;</span>само собой разумеется<span class="highlightText">&nbsp;?&nbsp;</span>была Маша.`, correctText: `Героиней этого романа<span class="highlightText">,&nbsp;</span>само собой разумеется<span class="highlightText">,&nbsp;</span>была Маша.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая нужна, это вводная конструкция.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна, вводные «само собой разумеется», «конечно», «возможно» выражают степень уверенности.`, needed: false}], author: `Л.Н. Толстой
«Отрочество»`}
, {id: 23, questionText: `Муму<span class="highlightText">&nbsp;?&nbsp;</span>по обыкновению<span class="highlightText">&nbsp;?&nbsp;</span>осталась его дожидаться.`, correctText: `Муму<span class="highlightText">,&nbsp;</span>по обыкновению<span class="highlightText">,&nbsp;</span>осталась его дожидаться.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая нужна, это вводная конструкция.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна, вводные «по обыкновению», «бывает», «случается» выделяются, а слово «обычно» нет.`, needed: false}], author: `И.С. Тургенев
«Муму»`}
, {id: 24, questionText: `Нынешняя молодёжь<span class="highlightText">&nbsp;?&nbsp;</span>не в обиду будь сказано<span class="highlightText">&nbsp;?&nbsp;</span>какая-то кислая, переваренная.`, correctText: `Нынешняя молодёжь<span class="highlightText">,&nbsp;</span>не в обиду будь сказано<span class="highlightText">,&nbsp;</span>какая-то кислая, переваренная.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая нужна, это вводная конструкция.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна, вводные «не в обиду сказано», «короче», «грубо говоря» описывают стиль высказывания.`, needed: false}], author: `А.П. Чехов
«Иванов»`}
, {id: 25, questionText: `Чего доброго<span class="highlightText">&nbsp;?&nbsp;</span>пожалуй, и женится из умиления души.`, correctText: `Чего доброго<span class="highlightText">,&nbsp;</span>пожалуй<span class="highlightText">,&nbsp;</span>и женится из умиления души.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая ставится между двумя вводными конструкциями.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая ставится между двумя вводными конструкциями «чего доброго» и «пожалуй».`, needed: false}], author: `Ф.М. Достоевский
«Село Степанчиково и его обитатели»`}
, {id: 26, questionText: `Несчастье нисколько его не изменило, а<span class="highlightText">&nbsp;?&nbsp;</span>напротив, он стал ещё крепче и энергичнее.`, correctText: `Несчастье нисколько его не изменило, а<span class="highlightText">&nbsp;?&nbsp;</span>напротив, он стал ещё крепче и энергичнее.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не ставится, когда вводное слово примыкает к союзу.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не ставится, когда вводное слово примыкает к союзу.`, needed: true}], author: `И.С. Тургенев
«Пунин и Бабурин»`}
, {id: 27, questionText: `Что<span class="highlightText">&nbsp;?&nbsp;</span>может<span class="highlightText">&nbsp;?&nbsp;</span>краткое свиданье мне в утешенье принести?`, correctText: `Что<span class="highlightText">&nbsp;?&nbsp;</span>может<span class="highlightText">&nbsp;?&nbsp;</span>краткое свиданье мне в утешенье принести?`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, «может» — часть сказуемого.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, «может» — часть сказуемого, а не вводное слово.`, needed: true}], author: `М.Ю. Лермонтов
Стихотворение в альбом Н.Ф. Ивановой`}
, {id: 28, questionText: `Кстати<span class="highlightText">&nbsp;?&nbsp;</span>он был замечательно хорош собой.`, correctText: `Кстати<span class="highlightText">,&nbsp;</span>он был замечательно хорош собой.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая нужна, потому что здесь «кстати» — вводное слово.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна, потому что здесь «кстати» — вводное слово. Сравните: «Его помощь была кстати».`, needed: false}], author: `Ф.М. Достоевский
«Преступление и наказание»`}
, {id: 29, questionText: `А на самом деле<span class="highlightText">&nbsp;?&nbsp;</span>гусар пошел в монахи, чтобы постичь жизнь. Назад он не вернулся.`, correctText: `А на самом деле гусар пошел в монахи, чтобы постичь жизнь. Назад он не вернулся.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, потому что здесь «на самом деле» — обстоятельство.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, потому что здесь «на самом деле» — обстоятельство. Можно заменить на «фактически, в действительности».`, needed: true}], author: `Илья Ильф, Евгений Петров
«Двенадцать стульев»`}
, {id: 30, questionText: `Рана моя медленно заживала, но<span class="highlightText">&nbsp;?&nbsp;</span>собственно<span class="highlightText">&nbsp;?&nbsp;</span>против отца у меня не было никакого дурного чувства.`, correctText: `Рана моя медленно заживала, но собственно против отца у меня не было никакого дурного чувства.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, потому что здесь «собственно» — частица.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, потому что здесь «собственно» — частица. Можно заменить на частицу «непосредственно».`, needed: true}], author: `И.С. Тургенев
«Первая любовь»`}
, {id: 31, questionText: `Смотри<span class="highlightText">&nbsp;?&nbsp;</span>однако, Вера, будь осторожна.`, correctText: `Смотри<span class="highlightText">,&nbsp;</span>однако<span class="highlightText">,&nbsp;</span>Вера, будь осторожна.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая нужна, здесь «однако» вводное слово.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна, здесь «однако» вводное слово. Его нельзя заменить союзом «но».`, needed: false}], author: `И.С. Тургенев
«Месяц в деревне»`}
, {id: 32, questionText: `Что ни говори<span class="highlightText">&nbsp;?&nbsp;</span>а любовь без надежд и требований трогает сердце женское вернее всех расчетов обольщения.`, correctText: `Что ни говори<span class="highlightText">,&nbsp;</span>а любовь без надежд и требований трогает сердце женское вернее всех расчетов обольщения.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая нужна, «что ни говори» — вводная конструкция.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна, вводные «что ни говори», «послушай», «смотри» привлекают внимание собеседника.`, needed: false}], author: `А.С. Пушкин
«Арап Петра Великого»`}
, {id: 33, questionText: `За чаем зашёл разговор о хозяйстве<span class="highlightText">&nbsp;?&nbsp;</span>вообще<span class="highlightText">&nbsp;?&nbsp;</span>и<span class="highlightText">&nbsp;?&nbsp;</span>в частности<span class="highlightText">&nbsp;?&nbsp;</span>об огородничестве.`, correctText: `За чаем зашёл разговор о хозяйстве вообще и в частности об огородничестве.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не ставится в конструкции «...вообще и ...в частности».`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не ставится в конструкции «...вообще и ...в частности».`, needed: true}], author: `М.Е. Салтыков-Щедрин
«Благонамеренные речи»`}
, {id: 34, questionText: `Родятся люди, женятся, умирают; значит<span class="highlightText">&nbsp;?&nbsp;</span>так нужно, значит<span class="highlightText">&nbsp;?&nbsp;</span>хорошо.`, correctText: `Родятся люди, женятся, умирают; значит<span class="highlightText">,&nbsp;</span>так нужно, значит<span class="highlightText">,&nbsp;</span>хорошо.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая нужна, здесь «значит» — это союз, близкий к вводному слову.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна, «значит» — это вводное слово. Его нельзя заменить на «это» или «вот».`, needed: false}], author: `А.Н. Островский
«Лес»`}
, {id: 35, questionText: `Человек<span class="highlightText">&nbsp;?&nbsp;</span>значит<span class="highlightText">&nbsp;?&nbsp;</span>неизмеримо больше, чем принято думать о нем.`, correctText: `Человек<span class="highlightText">&nbsp;?&nbsp;</span>значит<span class="highlightText">&nbsp;?&nbsp;</span>неизмеримо больше, чем принято думать о нем.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, «значит» — это сказуемое. `, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, «значит» — это сказуемое. `, needed: true}], author: `Максим Горький
«Заметка читателя»`}
, {id: 36, questionText: `Если бы я<span class="highlightText">&nbsp;?&nbsp;</span>по крайней мере<span class="highlightText">&nbsp;?&nbsp;</span>принес мою любовь в жертву моему будущему делу...`, correctText: `Если бы я<span class="highlightText">,&nbsp;</span>по крайней мере<span class="highlightText">,&nbsp;</span>принес мою любовь в жертву моему будущему делу...`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая нужна, здесь «по крайней мере» — вводная конструкция.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна. Здесь «по крайней мере» — вводная конструкция, так как её нельзя заменить на «как минимум».`, needed: false}], author: `И.С. Тургенев
«Рудин»`}
, {id: 37, questionText: `Он неутомимо искал этих встреч, а она<span class="highlightText">&nbsp;?&nbsp;</span>по крайней мере<span class="highlightText">&nbsp;?&nbsp;</span>их не избегала.`, correctText: `Он неутомимо искал этих встреч, а она<span class="highlightText">&nbsp;?&nbsp;</span>по крайней мере<span class="highlightText">&nbsp;?&nbsp;</span>их не избегала.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, здесь «по крайней мере» — обстоятельство.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна. Здесь «по крайней мере» — остоятельство, его можно заменить на «как минимум».`, needed: true}], author: `М.Ю. Лермонтов
«Княгиня Лиговская»`}
, {id: 38, questionText: `В самом деле<span class="highlightText">&nbsp;?&nbsp;</span>на третьем уроке Акулина разбирала уже по складам «Наталью, боярскую дочь».`, correctText: `В самом деле<span class="highlightText">,&nbsp;</span>на третьем уроке Акулина разбирала уже по складам «Наталью, боярскую дочь».`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая нужна, здесь «в самом деле» — вводная конструкция.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна, здесь «в самом деле» — вводная конструкция, её можно опустить без потери смысла. Сравните: «Это в самом деле произошло».`, needed: false}], author: `А.С. Пушкин
«Барышня-крестьянка»`}
, {id: 39, questionText: `Между тем<span class="highlightText">&nbsp;?&nbsp;</span>он успел заметить ножку, с намерением выставленную и обутую со всевозможным кокетством.`, correctText: `Между тем<span class="highlightText">&nbsp;?&nbsp;</span>он успел заметить ножку, с намерением выставленную и обутую со всевозможным кокетством.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, «между тем» никогда не выделяется.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, «между тем» никогда не выделяется.`, needed: true}], author: `А.С. Пушкин
«Барышня-крестьянка»`}
, {id: 40, questionText: `Итак<span class="highlightText">&nbsp;?&nbsp;</span>она звалась Татьяной.`, correctText: `Итак<span class="highlightText">,&nbsp;</span>она звалась Татьяной.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая нужна, «итак» — это союз, близкий к вводному слову.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна, «итак» — это союз, близкий к вводному слову. Всегда выделяется.`, needed: false}], author: `А.С. Пушкин
«Евгений Онегин»`}
, {id: 41, questionText: `И хотя сердце его<span class="highlightText">&nbsp;?&nbsp;</span>как нам известно<span class="highlightText">&nbsp;?&nbsp;</span>было уже занято, но молодая красавица всегда имела право на его воображение.`, correctText: `И хотя сердце его<span class="highlightText">,&nbsp;</span>как нам известно<span class="highlightText">,&nbsp;</span>было уже занято, но молодая красавица всегда имела право на его воображение.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая нужна, «как нам известно» — вводная конструкция.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна. Вводные «ни для кого не секрет», «как нам известно» всегда выделяются запятыми.`, needed: false}], author: `А.С. Пушкин
«Барышня-крестьянка»`}
, {id: 42, questionText: `Порою<span class="highlightText">&nbsp;?&nbsp;</span>мне казалось, что я погружаюсь в некую глубину.`, correctText: `Порою<span class="highlightText">&nbsp;?&nbsp;</span>мне казалось, что я погружаюсь в некую глубину.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна. Здесь «мне казалось» — сказуемое с дополнением.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна. Здесь «мне казалось» — сказуемое с дополнением. Подсказка: во второй части предложения есть союз «что».`, needed: true}], author: `М. Горький`}
, {id: 43, questionText: `Извольте себе стрелять, а<span class="highlightText">&nbsp;?&nbsp;</span>впрочем, как вам угодно; выстрел ваш остается за вами.`, correctText: `Извольте себе стрелять, а<span class="highlightText">&nbsp;?&nbsp;</span>впрочем, как вам угодно; выстрел ваш остается за вами.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не ставится, когда вводное слово примыкает к союзу.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не ставится, когда вводное слово примыкает к союзу.`, needed: true}], author: `А.С. Пушкин
«Выстрел»`}
, {id: 44, questionText: `Адриан Прохоров<span class="highlightText">&nbsp;?&nbsp;</span>обыкновенно<span class="highlightText">&nbsp;?&nbsp;</span>был угрюм и задумчив.`, correctText: `Адриан Прохоров<span class="highlightText">&nbsp;?&nbsp;</span>обыкновенно<span class="highlightText">&nbsp;?&nbsp;</span>был угрюм и задумчив.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не ставится, «обыкновенно» — обстоятельство.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не ставится, «обыкновенно», «обычно» — обстоятельства и не выделяются запятыми.`, needed: true}], author: `А.С. Пушкин
«Гробовщик»`}
, {id: 45, questionText: `Пили здоровье всех цехов<span class="highlightText">&nbsp;?&nbsp;</span>вообще<span class="highlightText">&nbsp;?&nbsp;</span>и каждого<span class="highlightText">&nbsp;?&nbsp;</span>в особенности, пили здоровье мастеров и подмастерьев.`, correctText: `Пили здоровье всех цехов<span class="highlightText">&nbsp;?&nbsp;</span>вообще<span class="highlightText">&nbsp;?&nbsp;</span>и каждого<span class="highlightText">&nbsp;?&nbsp;</span>в особенности, пили здоровье мастеров и подмастерьев.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не ставится в конструкции «...вообще и ...в особенности».`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не ставится в конструкции «...вообще и ...в особенности».`, needed: true}], author: `А.С. Пушкин
«Гробовщик»`}
, {id: 46, questionText: `Давно, давно стараются, а проку<span class="highlightText">&nbsp;?&nbsp;</span>все-таки<span class="highlightText">&nbsp;?&nbsp;</span>нет.`, correctText: `Давно, давно стараются, а проку<span class="highlightText">&nbsp;?&nbsp;</span>все-таки<span class="highlightText">&nbsp;?&nbsp;</span>нет.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не ставится, «всё-таки» — частица.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не ставится, «всё-таки», «якобы», «вроде» — частицы, а не вводные слова.`, needed: true}], author: `А.С. Пушкин
«Дубровский»`}
, {id: 47, questionText: `Именно<span class="highlightText">&nbsp;?&nbsp;</span>в такой день случилось мне быть на охоте.`, correctText: `Именно<span class="highlightText">&nbsp;?&nbsp;</span>в такой день случилось мне быть на охоте.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не ставится, «именно» — частица.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не ставится, «именно», «совсем», «почти» — частицы, а не вводные слова.`, needed: true}], author: `И.С. Тургенев
«Малиновая вода»`}
, {id: 48, questionText: `Старик любил<span class="highlightText">&nbsp;?&nbsp;</span>при случае<span class="highlightText">&nbsp;?&nbsp;</span>показать себя: дескать, и мы живали в свете!`, correctText: `Старик любил<span class="highlightText">&nbsp;?&nbsp;</span>при случае<span class="highlightText">&nbsp;?&nbsp;</span>показать себя: дескать, и мы живали в свете!`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не ставится, «при случае» — обстоятельство.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не ставится, «при случае», «в любом случае» — обстоятельства, а не вводные слова.`, needed: true}], author: `И.С. Тургенев
«Малиновая вода»`}
, {id: 49, questionText: `Я внутренне дал себе слово<span class="highlightText">&nbsp;?&nbsp;</span>во что бы то ни стало<span class="highlightText">&nbsp;?&nbsp;</span>освободить бедняка.`, correctText: `Я внутренне дал себе слово<span class="highlightText">&nbsp;?&nbsp;</span>во что бы то ни стало<span class="highlightText">&nbsp;?&nbsp;</span>освободить бедняка.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не ставится, фразеологизм «во что бы то ни стало» никогда не выделяется.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не ставится, фразеологизм «во что бы то ни стало» никогда не выделяется.`, needed: true}], author: `И.С. Тургенев
«Бирюк»`}
, {id: 50, questionText: `Муму даже и не понюхала молока и всё дрожала и озиралась<span class="highlightText">&nbsp;?&nbsp;</span>по-прежнему.`, correctText: `Муму даже и не понюхала молока и всё дрожала и озиралась<span class="highlightText">&nbsp;?&nbsp;</span>по-прежнему.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не ставится, «по-прежнему» — обстоятельство и никогда не выделяется.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не ставится, «по-прежнему» — обстоятельство и никогда не выделяется.`, needed: true}], author: `И.С. Тургенев
«Муму»`}
, {id: 51, questionText: `В самом деле<span class="highlightText">&nbsp;?&nbsp;</span>что было бы с нами, если бы вместо общеудобного правила: чин чина почитай, ввелось в употребление другое, например: ум ума почитай?`, correctText: `В самом деле<span class="highlightText">,&nbsp;</span>что было бы с нами, если бы вместо общеудобного правила: чин чина почитай, ввелось в употребление другое, например: ум ума почитай?`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая нужна, здесь «в самом деле» — вводная конструкция.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна, здесь «в самом деле» — вводная конструкция, её можно опустить без потери смысла. Сравните: «Это в самом деле произошло».`, needed: false}], author: `А.С. Пушкин
«Станционный смотритель»`}
    ];

    const dashQuestions = [
      {
        id: 1,
        questionText: `Театр уж полон; ложи блещут;
    Партер и кресла |+| все кипит.`,
        correctText: `Театр уж полон; ложи блещут;
    Партер и кресла — все кипит.`,
        trueRuleInfo: `Тире ставится перед обобщающим словом.`,
        falseRuleInfo: `Тире ставится перед обобщающим словом «всё», которое стоит после однородных членов предложения «партер» и «кресла».`,
        author: `А.С. Пушкин «Евгений Онегин»`
      },
      {
        id: 2,
        questionText: `Петр Петрович, по крайней мере по моим признакам, |+| человек весьма почтенный.`,
        correctText: `Петр Петрович, по крайней мере по моим признакам, человек весьма почтенный.`,
        trueRuleInfo: `Тире не ставится, так как между подлежащим и сказуемым есть вводная конструкция.`,
        falseRuleInfo: `Тире не ставится, так как между подлежащим и сказуемым есть вводная конструкция «по крайней мере по моим признакам».`,
        author: `Ф.М. Достоевский
    «Преступление и наказание»`
      },
      {
        id: 3,
        questionText: `Я |-| честный человек и никогда не говорю комплиментов.`,
        correctText: `Я честный человек и никогда не говорю комплиментов.`,
        trueRuleInfo: `Тире не ставится, так как подлежащее выражено местоимением.`,
        falseRuleInfo: `Тире не ставится, когда подлежащее выражено местоимением.`,
        author: `А.П. Чехов
    «Учитель»`
      },
      {
        id: 4,
        questionText: `Погода |-| несносная, дорога |-| скверная, ямщик |-| упрямый — а виноват смотритель.`,
        correctText: `Погода несносная, дорога скверная, ямщик упрямый — а виноват смотритель.`,
        trueRuleInfo: `Тире не ставится, так как сказуемое — прилагательное.`,
        falseRuleInfo: `Тире не ставится во всех частях предложения, так как сказуемые в них выражены прилагательными, а тире ставится между двумя существительными, глаголами или числительными.`,
        author: `А.С. Пушкин
    «Станционный смотритель»`
      },
      {
        id: 5,
        questionText: `Мы почитаем всех нулями, А единицами|-| себя.`,
        correctText: `Мы почитаем всех нулями, А единицами — себя.`,
        trueRuleInfo: `Тире ставится в неполном предложении.`,
        falseRuleInfo: `Часть предложения — неполная, в ней пропущено сказуемое «почитаем» и на его месте ставится тире.`,
        author: `А.С. Пушкин
    «Евгений Онегин»`
      },
      {
        id: 6,
        questionText: `А гений и злодейство |+|
    Две вещи несовместные. Не правда ль?`,
        correctText: `А гений и злодейство —
    Две вещи несовместные. Не правда ль?`,
        trueRuleInfo: `Тире ставится между подлежащим и сказуемым.`,
        falseRuleInfo: `Тире ставится между подлежащим и сказуемым, так как они выражены существительными.`,
        author: `А.С. Пушкин
    «Моцарт и Сольери»`
      },
      {
        id: 7,
        questionText: `Петербург |+|
    прихожая, Москва |+|
    девичья, деревня же |+|
    наш кабинет.`,
        correctText: `Петербург — прихожая, Москва — девичья, деревня же — наш кабинет.`,
        trueRuleInfo: `Тире ставится между подлежащим и сказуемым.`,
        falseRuleInfo: `Тире ставится между подлежащим и сказуемым, так как во всех случаях они выражены существительными. Частица «же» никак не влияет на постановку тире.`,
        author: `А.С. Пушкин
    «Роман в письмах»`
      },
      {
        id: 8,
        questionText: `Встретясь с этим человеком в лесу, вы приняли бы его за разбойника; в обществе |+|
    за политического заговорщика; в передней |+| за шарлатана, торгующего эликсирами и мышьяком.`,
        correctText: `Встретясь с этим человеком в лесу, вы приняли бы его за разбойника; в обществе — за политического заговорщика; в передней — за шарлатана, торгующего эликсирами и мышьяком.`,
        trueRuleInfo: `Тире ставится в неполном предложении.`,
        falseRuleInfo: `В обоих случаях перед нами неполные предложения. В них пропущены сказуемое «почитаем» и на его месте ставится тире.`,
        author: `А.С. Пушкин
    «Египетские ночи»`
      },
      {
        id: 9,
        questionText: `Я |-| раб, я |-| царь, я |-| червь, я |-| бог.`,
        correctText: `Я раб, я царь, я червь, я  бог.`,
        trueRuleInfo: `Тире не ставится, так как подлежащее выражено местоимением.`,
        falseRuleInfo: `Тире не ставится ни в одном из предложений, так как подлежащее выражено местоимением.`,
        author: `Г.Р. Державин
    «Бог»`
      },
      {
        id: 10,
        questionText: `Честолюбие |-| есть не что иное, как жажда власти.`,
        correctText: `Честолюбие есть не что иное, как жажда власти.`,
        trueRuleInfo: `Тире не ставится, так как есть связка «есть» и отрицательная частица «не».`,
        falseRuleInfo: `Тире не ставится, если между подлежащим и сказуемым стоит глагол-связка «есть».`,
        author: `М.Ю. Лермонтов
    «Герой нашего времени»`
      },
      {
        id: 11,
        questionText: `Тамань |+| самый скверный городишко из всех приморских городов России.`,
        correctText: `Тамань — самый скверный городишко из всех приморских городов России.`,
        trueRuleInfo: `Тире ставится между подлежащим и сказуемым, выраженными существительными.`,
        falseRuleInfo: `Тире ставится между подлежащим и сказуемым, выраженными существительными.`,
        author: `М.Ю. Лермонтов
    «Герой нашего времени»`
      },
      {
        id: 12,
        questionText: `Производить эффект |+| их наслаждение; они
    нравятся романтическим провинциалкам до безумия.`,
        correctText: `Производить эффект — их наслаждение; они
    нравятся романтическим провинциалкам до безумия.`,
        trueRuleInfo: `Тире ставится между подлежащим и сказуемым, выраженным существительным и глаголом.`,
        falseRuleInfo: `Тире ставится между подлежащим и сказуемым, выраженным существительным и глаголом.`,
        author: `М.Ю. Лермонтов
    «Герой нашего времени»`
      },
      {
        id: 13,
        questionText: `Его цель |+| сделаться героем романа. Он так часто старался уверить других в том, что он |-| существо,
    не созданное для мира, обреченное каким-то тайным страданиям, что он сам
    почти в этом уверился.`,
        correctText: `Его цель — сделаться
    героем романа. Он так часто старался уверить других в том, что он существо,
    не созданное для мира, обреченное каким-то тайным страданиям, что он сам
    почти в этом уверился.`,
        trueRuleInfo: `Тире ставится, когда подлежащее и сказуемое выражены существительным и глаголом, и не ставится, когда подлежащее — местоимение.`,
        falseRuleInfo: `Тире ставится, когда подлежащее и сказуемое выражены существительным и глаголом, и не ставится, когда подлежащее — местоимение.`,
        author: `М.Ю. Лермонтов
    «Герой нашего времени»`
      },
      {
        id: 14,
        questionText: `Обязанность |-| для меня дело священное, закон — я немею пред законом.`,
        correctText: `Обязанность для меня дело священное, закон — я немею пред законом.`,
        trueRuleInfo: `Тире не ставится, так как между подлежащим и сказуемым стоит дополнение «для меня».`,
        falseRuleInfo: `Тире не ставится, так как между подлежащим и сказуемым стоит дополнение «для меня».`,
        author: `Н.В. Гоголь
    «Мёртвые души»`
      },
      {
        id: 15,
        questionText: `Отчизна |-| есть то, что ищет душа наша, что милее для нее всего. Отчизна моя |+| ты.`,
        correctText: `Отчизна есть то, что ищет душа наша, что милее для нее всего. Отчизна моя — ты.`,
        trueRuleInfo: `Тире не ставится, если в предложении есть слово «есть». Обычно тире не ставится в предложениях с местоимением, но его можно использовать для особой экспрессии.`,
        falseRuleInfo: `Тире не ставится, если в предложении есть слово «есть». Обычно тире не ставится в предложениях с местоимением, но его можно использовать для особой экспрессии.`,
        author: `Н.В. Гоголь
    «Тарас Бульба»`
      },
      {
        id: 16,
        questionText: `Экипажи, дом, отлично устроенный, вкусные обеды |+| вот что беспрерывно носилось в голове его.`,
        correctText: `Экипажи, дом, отлично устроенный, вкусные обеды — вот что беспрерывно носилось в голове его.`,
        trueRuleInfo: `Тире ставится перед обобщающим словом «что».`,
        falseRuleInfo: `Тире ставится перед обобщающим словом «что».`,
        author: `Н.В. Гоголь
    «Мёртвые души»`
      },
      {
        id: 17,
        questionText: `Они смотрели друг на друга: Райский |+| с холодным любопытством, она |+| с дерзким торжеством.`,
        correctText: `Они смотрели друг на друга: Райский — с холодным любопытством, она — с дерзким торжеством.`,
        trueRuleInfo: `Тире ставится в обоих случаях на месте пропущенного сказуемого «смотрели».`,
        falseRuleInfo: `Тире ставится в обоих случаях на месте пропущенного сказуемого «смотрели».`,
        author: `И.А. Гончаров
    «Обломов»`
      },
      {
        id: 18,
        questionText: `Мысль изречённая |-| есть ложь.`,
        correctText: `Мысль изречённая есть ложь.`,
        trueRuleInfo: `Тире не ставится, если в предложении есть глагол «есть».`,
        falseRuleInfo: `Тире не ставится, если в предложении есть глагол «есть».`,
        author: `Ф.И. Тютчев
    «Silentium!»`
      },
      {
        id: 19,
        questionText: `Поэзия —
    Не профессия,
    Поэзия |-| как любовь.`,
        correctText: `Поэзия —
    Не профессия,
    Поэзия как любовь.`,
        trueRuleInfo: `Тире не ставится, если есть отрицание «не».`,
        falseRuleInfo: `Тире не ставится, если есть отрицание «не».`,
        author: `В.Д. Фёдоров
    «Поэзия — не профессия...»`
      },
      {
        id: 20,
        questionText: `Я не знал, что любовь |+| зараза,
    Я не знал, что любовь |+| чума.
    Подошла и прищуренным глазом
    Хулигана свела с ума.`,
        correctText: `Я не знал, что любовь — зараза,
    Я не знал, что любовь — чума.
    Подошла и прищуренным глазом
    Хулигана свела с ума.`,
        trueRuleInfo: `Тире ставится, когда подлежащее и сказуемое выражены существительными.`,
        falseRuleInfo: `Тире ставится, когда подлежащее и сказуемое выражены существительными.`,
        author: `С.Есенин
    «Пой же, пой. На проклятой гитаре...»`
      },
      {
        id: 21,
        questionText: `Песня с бурей |-| вечно сестры.`,
        correctText: `Песня с бурей вечно сестры.`,
        trueRuleInfo: `Тире не ставится, когда между подлежащим и сказуемым стоит обстоятельство.`,
        falseRuleInfo: `Тире не ставится, потому что между подлежащим и сказуемым стоит обстоятельство «вечно».`,
        author: `В. Брюсов
    «Кинжал»`
      }
    ];

    return { commaQuestions, timerQuestions, dashQuestions };
  }

  // Overrides the genId method to ensure that a item always has an id.
  // If the array is empty,
  // the method below returns the initial number (1).
  // if the array is not empty, the method below returns the highest
  // item id + 1.
  genId(questions: Question[]): number {
    return questions.length > 0 ? Math.max(...questions.map(question => question.id)) + 1 : 1;
  }
}
