import { Question } from './question';
import { InMemoryDbService } from 'angular-in-memory-web-api';
import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class InMemoryDataService implements InMemoryDbService {
  createDb() {
    const commaQuestions = [
      {
        id: 1,
        questionText: `Виконт был подан обществу в самом изящном и выгодном для него свете,
        как ростбиф на горячем блюде, посыпанный зеленью.`,
        correctText: `Виконт был подан обществу в самом изящном и выгодном для него свете,
        как ростбиф на горячем блюде, посыпанный зеленью.`,
        helpMessage: 'Автор сравнивает виконта с ростбифом, сказуемое — «был подан».',
        ruleInfo: 'Без запятой, это сказуемое. Запятая нужна, это сравнение.',
        isCorrect: true
      },
      {
        id: 2,
        questionText: `Ничто так не нужно молодому человеку, как общество умных женщин.`,
        correctText: `Ничто так не нужно молодому человеку, как общество умных женщин.`,
        helpMessage:
          'Если в первой части предложения есть слово «так», «такой», «тот», то запятая всегда ставится. Кроме случаев с союзом «так как».',
        ruleInfo: 'Без запятой, значение «в качестве». Запятая всегда нужна в такой конструкции.',
        isCorrect: true
      },
      {
        id: 3,
        questionText: `Пьер был неуклюж. Он, как говорится, не умел войти в салон и еще менее умел из него выйти.`,
        correctText: `Пьер был неуклюж. Он, как говорится, не умел войти в салон и еще менее умел из него выйти.`,
        helpMessage: 'Запятыми выделяются вводные словосочетания «как говорят», «как водится», «как всегда» и т.п.',
        ruleInfo: 'Без запятой, это фразеологизм. Запятая нужна, это вводное словосочетание.',
        isCorrect: true
      },
      {
        id: 4,
        questionText: `Москве больше делать нечего, как сплетничать.`,
        correctText: `Москве больше делать нечего, как сплетничать.`,
        helpMessage: '',
        ruleInfo: '',
        isCorrect: true
      },
      {
        id: 5,
        questionText: `Француз стоял как вкопанный.`,
        correctText: `Француз стоял как вкопанный.`,
        helpMessage: 'Француз свалился как снег на голову.',
        ruleInfo: 'Без запятой, это фразеологизм. Запятая нужна, это сравнение.',
        isCorrect: true
      },
      {
        id: 6,
        questionText: `Один Иван Петрович был как дома: ел за двоих, пил в свою меру, смеялся своему смеху.`,
        correctText: `Один Иван Петрович был как дома: ел за двоих, пил в свою меру, смеялся своему смеху.`,
        helpMessage: 'Будет ли предложение понятным без этого словосочетания?',
        ruleInfo: 'Без запятой, это часть сказуемого. Запятая нужна, есть значение причины.',
        isCorrect: true
      },
      {
        id: 7,
        questionText: `И Ленский, жмуря левый глаз
Стал тоже целить, но как раз
Онегин выстрелил.`,
        correctText: `И Ленский, жмуря левый глаз
Стал тоже целить, но как раз
Онегин выстрелил.`,
        helpMessage: '«Как раз», «только», «лишь» — усилительные частицы.',
        ruleInfo: 'Без запятой, это частица. Запятая нужна, это вводное словосочетание.',
        isCorrect: true
      },
      {
        id: 8,
        questionText: `Промчалось много, много дней,
С тех пор как юная Татьяна
И с ней Онегин в смутном сне
Явилися впервые мне.`,
        correctText: `Промчалось много, много дней,
С тех пор как юная Татьяна
И с ней Онегин в смутном сне
Явилися впервые мне.`,
        helpMessage: 'Между частями этого сложного предложения уже стоит запятая.',
        ruleInfo: 'Без запятой, это сложный союз. Запятая нужна, это сложное предложение.',
        isCorrect: true
      },
      {
        id: 9,
        questionText: `Ты женишься, или я тебя прокляну, а имение, как бог свят, продам и
промотаю!`,
        correctText: `Ты женишься, или я тебя прокляну, а имение, как бог свят, продам и
промотаю!`,
        helpMessage: 'Вводные словосочетания «вот те крест», «честное слово» выражают уверенность говорящего.',
        ruleInfo: 'Без запятой, это частица. Запятая нужна, это вводное словосочетание.',
        isCorrect: true
      },
      {
        id: 10,
        questionText: `Лучший
стрелок, которого удалось мне встречать, стрелял каждый день, по крайней
мере три раза перед обедом. Это у него было заведено, как рюмка водки.`,
        correctText: `Лучший
стрелок, которого удалось мне встречать, стрелял каждый день, по крайней
мере три раза перед обедом. Это у него было заведено, как рюмка водки.`,
        helpMessage: 'Если удалить сравнение, смысл предложения по-прежнему будет понятен.',
        ruleInfo: 'Без запятой, это часть сказуемого. Запятая нужна, это сравнение.',
        isCorrect: true
      },
      {
        id: 11,
        questionText: `Приказчика моего
нашли на другой день в лесу, привязанного к дубу и ободранного как липку.`,
        correctText: `Приказчика моего
нашли на другой день в лесу, привязанного к дубу и ободранного как липку.`,
        helpMessage: 'Его ободрали как липку — и он стал гол как сокол.',
        ruleInfo: 'Без запятой, это фразеологизм. Запятая нужна, это сравнение.',
        isCorrect: true
      },
      {
        id: 12,
        questionText: `Вот уж 5
часов как дожидается лошадей да свищет. Надоел проклятый.`,
        correctText: `Вот уж 5
часов как дожидается лошадей да свищет. Надоел проклятый.`,
        helpMessage: '',
        ruleInfo: '',
        isCorrect: true
      },
      {
        id: 13,
        questionText: `Руслан уныньем как убит;
Мысль о потерянной невесте
Его терзает и мертвит.`,
        correctText: `Руслан уныньем как убит;
Мысль о потерянной невесте
Его терзает и мертвит.`,
        helpMessage: 'Предложение не потеряет смысла, если выбросить из него сравнение.',
        ruleInfo: 'Без запятой, это сказуемое. Запятая нужна, это сравнение.',
        isCorrect: true
      },
      {
        id: 14,
        questionText: `Уж витязь под горой стоит,
Призывный рог, как буря, воет,
Нетерпеливый конь кипит
И снег копытом мочным роет.`,
        correctText: `Уж витязь под горой стоит,
Призывный рог, как буря, воет,
Нетерпеливый конь кипит
И снег копытом мочным роет.`,
        helpMessage: 'Предложение потеряет смысла, если выбросить из него сказуемое.',
        ruleInfo: 'Без запятой, это фразеологизм. Запятая нужна, это сравнение.',
        isCorrect: true
      },
      {
        id: 15,
        questionText: `А их глазищи желтые
Горят, как воску ярого
Четырнадцать свечей!`,
        correctText: `А их глазищи желтые
Горят, как воску ярого
Четырнадцать свечей!`,
        helpMessage: 'Можно ли «как» заменить на «в качестве»?',
        ruleInfo: 'Без запятой, значение «в качестве». Запятая нужна, это сравнение.',
        isCorrect: true
      },
      {
        id: 16,
        questionText: `Мой совет: обвенчаться как можно скорее в вашей деревянной церкви и приезжать к нам.`,
        correctText: `Мой совет: обвенчаться как можно скорее в вашей деревянной церкви и приезжать к нам.`,
        helpMessage: 'Наречные выражения «как можно скорее (...больше, выше)» не выделяются запятыми.',
        ruleInfo: 'Без запятой, это наречное выражение. Запятая нужна, это сложное предложение.',
        isCorrect: true
      },
      {
        id: 17,
        questionText: `Я не корчу английского лорда, как дипломат Северин, внук портного и повара.`,
        correctText: `Я не корчу английского лорда, как дипломат Северин, внук портного и повара.`,
        helpMessage: 'Автор письма сравнивает себя с дипломатом Севериным.',
        ruleInfo: 'Без запятой, значение причины. Запятая нужна, это сравнение.',
        isCorrect: true
      },
      {
        id: 18,
        questionText: `Сотни верст пустынной, однообразной, выгоревшей степи не могут нагнать такого уныния,
        как один человек, когда он сидит, говорит и неизвестно, когда он уйдет.`,
        correctText: `Сотни верст пустынной, однообразной, выгоревшей степи не могут нагнать такого уныния,
        как один человек, когда он сидит, говорит и неизвестно, когда он уйдет.`,
        helpMessage: '',
        ruleInfo: '',
        isCorrect: true
      },
      {
        id: 19,
        questionText: `Да, всё он делал не как люди.`,
        correctText: `Да, всё он делал не как люди.`,
        helpMessage: '',
        ruleInfo: '',
        isCorrect: true
      },
      {
        id: 20,
        questionText: `По мнению здешних ученых, этот провал не что иное, как угасший кратер.`,
        correctText: `По мнению здешних ученых, этот провал не что иное, как угасший кратер.`,
        helpMessage: '',
        ruleInfo: '',
        isCorrect: true
      },
      {
        id: 21,
        questionText: `Честолюбие есть не что иное, как жажда власти.`,
        correctText: `Честолюбие есть не что иное, как жажда власти.`,
        helpMessage: '',
        ruleInfo: '',
        isCorrect: true
      },
      {
        id: 22,
        questionText: `Гость был не кто другой, как наш почтенный Павел Иванович Чичиков.`,
        correctText: `Гость был не кто другой, как наш почтенный Павел Иванович Чичиков.`,
        helpMessage: '',
        ruleInfo: '',
        isCorrect: true
      },
      {
        id: 23,
        questionText: `Она была, как меньшая, любимица отца.`,
        correctText: `Она была, как меньшая, любимица отца.`,
        helpMessage: '',
        ruleInfo: '',
        isCorrect: true
      },
      {
        id: 24,
        questionText: `Итак, я вам советую как приятель быть осторожнее.`,
        correctText: `Итак, я вам советую как приятель быть осторожнее.`,
        helpMessage: '',
        ruleInfo: '',
        isCorrect: true
      },
      {
        id: 25,
        questionText: `Богат, хорош собою, Ленский Везде был принят как жених.`,
        correctText: `Богат, хорош собою, Ленский Везде был принят как жених.`,
        helpMessage: '',
        ruleInfo: '',
        isCorrect: true
      }
    ];

    const timerQuestions = [
      {
        id: 1,
        questionText: 'Марья Гавриловна была воспитана на французских романах и следственно была влюблена.',
        correctText:
          'Марья Гавриловна была воспитана на французских романах и<span class="resultText">, следственно,</span> была влюблена.',
        helpMessage: '—',
        ruleInfo: 'А.С. Пушкин «Метель»',
        isCorrect: false
      },
      {
        id: 2,
        questionText: 'Старушка сидела однажды одна в гостиной, раскладывая гран-пасьянс.',
        correctText: 'Старушка сидела однажды одна в гостиной, раскладывая гран-пасьянс.',
        helpMessage: 'Нет подсказки',
        ruleInfo: 'Запятые не нужны',
        isCorrect: true
      }
    ];

    const dashQuestions = [
      {
        id: 1,
        questionText:
          'Погода !_dash-!_ несносная, дорога !_dash-!_ скверная, ямщик  !_dash-!_ упрямый — а виноват смотритель.',
        correctText:
          'Погода !_dash-!_ несносная, дорога !_dash-!_ скверная, ямщик  !_dash-!_ упрямый — а виноват смотритель.',
        helpMessage: '',
        ruleInfo: `Тире не ставится во всех частях предложения, так как сказуемые в них выражены прилагательными,
          а тире ставится между двумя существительными, глаголами или числительными.`,
        isCorrect: true
      },
      {
        id: 2,
        questionText: 'Петр Петрович, по крайней мере по моим признакам, !_dash-!_ человек весьма почтенный.',
        correctText: 'Петр Петрович, по крайней мере по моим признакам, !_dash-!_ человек весьма почтенный.',
        helpMessage: 'Нет подсказки',
        ruleInfo:
          'Тире не ставится, так как между подлежащим и сказуемым есть вводная конструкция «по крайней мере по моим признакам».',
        isCorrect: false
      },
      {
        id: 3,
        questionText: 'Я !_dash-!_ честный человек и никогда не говорю комплиментов.',
        correctText: 'Я !_dash-!_ честный человек и никогда не говорю комплиментов.',
        helpMessage: 'Нет подсказки',
        ruleInfo: 'Тире не ставится, когда подлежащее выражено местоимением.',
        isCorrect: false
      },
      {
        id: 4,
        questionText: 'Театр уж полон; ложи блещут; Партер и кресла !_dash+!_ все кипит.',
        correctText: 'Театр уж полон; ложи блещут; Партер и кресла !_dash+!_ все кипит.',
        helpMessage: '',
        ruleInfo:
          'Тире ставится перед обобщающим словом «всё», которое стоит после однородных членов предложения «партер» и «кресла».',
        isCorrect: true
      }
    ];

    return { commaQuestions, timerQuestions, dashQuestions };
  }

  // Overrides the genId method to ensure that a item always has an id.
  // If the array is empty,
  // the method below returns the initial number (1).
  // if the array is not empty, the method below returns the highest
  // item id + 1.
  genId(questions: Question[]): number {
    return questions.length > 0 ? Math.max(...questions.map(question => question.id)) + 1 : 1;
  }
}
