import { Question } from './question';
import { InMemoryDbService } from 'angular-in-memory-web-api';
import { Injectable } from '@angular/core';

// tslint:disable:max-line-length
@Injectable({
  providedIn: 'root'
})
export class InMemoryDataService implements InMemoryDbService {
  createDb() {
    const commaQuestions = [
      {id: 1, questionText: `Виконт был подан обществу в самом изящном и выгодном для него свете <span class="highlightText">как ростбиф на горячем блюде, посыпанный зеленью.</span>`, correctText: `Виконт был подан обществу в самом изящном и выгодном для него свете, <span class="highlightText">как ростбиф на горячем блюде, посыпанный зеленью.</span>`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Запятая нужна, потому что это сравнение.`, needed: true}, { name: 'Без запятой, это сказуемое',  ruleInfo: `Запятая нужна, потому что это сравнение.`, needed: false}], helpMessage: 'Автор сравнивает виконта с ростбифом, сказуемое — «был подан».', author: `Л. Н. Толстой
«Война и мир»`}
, {id: 2, questionText: `Ничто так не нужно молодому человеку <span class="highlightText">как общество умных женщин.</span>`, correctText: `Ничто так не нужно молодому человеку, <span class="highlightText">как общество умных женщин.</span>`, buttons: [{name: 'Запятая всегда нужна в такой конструкции', ruleInfo: `Запятая всегда нужна в конструкции «ничто так не… , как».`, needed: true}, { name: 'Без запятой, значение «в качестве»',  ruleInfo: `Запятая всегда нужна в конструкции «ничто так не… , как».`, needed: false}], helpMessage: 'Если в первой части предложения есть слово «так», «такой», «тот», то запятая всегда ставится. Кроме случаев с союзом «так как».', author: `Л. Н. Толстой
«Война и мир»`}
, {id: 3, questionText: `Пьер был неуклюж. Он <span class="highlightText">как говорится</span> не умел войти в салон и еще менее умел из него выйти.`, correctText: `Пьер был неуклюж. Он, <span class="highlightText">как говорится,</span> не умел войти в салон и еще менее умел из него выйти.`, buttons: [{name: 'Запятая нужна, это вводное словосочетание', ruleInfo: `«Как говорится» — вводная конструкция и выделяется запятыми.`, needed: true}, { name: 'Без запятой, это фразеологизм',  ruleInfo: `«Как говорится» — вводная конструкция и выделяется запятыми.`, needed: false}], helpMessage: 'Запятыми выделяются вводные словосочетания «как говорят», «как водится», «как всегда» и т.п.', author: `Л. Н. Толстой
«Война и мир»`}
, {id: 4, questionText: `Москве больше делать нечего <span class="highlightText">как сплетничать</span>.`, correctText: `Москве больше делать нечего, <span class="highlightText">как сплетничать.</span>`, buttons: [{name: 'Запятая нужна, значение исключения', ruleInfo: `Оборот с «как» выделяется запятой, потому что имеет значение исключения.`, needed: true}, { name: 'Без запятой, часть сказуемого',  ruleInfo: `Оборот с «как» выделяется запятой, потому что имеет значение исключения. Проверка: можно заменить на «кроме как».`, needed: false}], helpMessage: 'Москве больше делать нечего, кроме как сплетничать.', author: `Л. Н. Толстой
«Война и мир»`}
, {id: 5, questionText: `Француз стоял <span class="highlightText">как вкопанный</span>.`, correctText: `Француз стоял <span class="highlightText">как вкопанный.</span>`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `«Стоял как вкопанный» — фразеологизм, пишется без запятой.`, needed: false}, { name: 'Без запятой, это фразеологизм',  ruleInfo: `«Стоял как вкопанный» — фразеологизм, пишется без запятой.`, needed: true}], helpMessage: 'Француз свалился как снег на голову.', author: `А.С. Пушкин
«Дубровский»`}
, {id: 6, questionText: `Один Иван Петрович был <span class="highlightText">как дома</span>: ел за двоих, пил в свою меру, смеялся своему смеху.`, correctText: `Один Иван Петрович был <span class="highlightText">как дома</span>: ел за двоих, пил в свою меру, смеялся своему смеху.`, buttons: [{name: 'Запятая нужна, есть значение причины', ruleInfo: `Сказуемое — «был как дома», а запятой внутри сказуемого быть не может.`, needed: false}, { name: 'Без запятой, это часть сказуемого',  ruleInfo: `Сказуемое — «был как дома», а запятой внутри сказуемого быть не может.`, needed: true}], helpMessage: 'Будет ли предложение понятным без этого словосочетания?', author: `А.С. Пушкин
«Барышня-крестьянка»`}
, {id: 7, questionText: `И Ленский, жмуря левый глаз
Стал тоже целить, но <span class="highlightText">как раз</span>
Онегин выстрелил.`, correctText: `И Ленский, жмуря левый глаз
Стал тоже целить, но <span class="highlightText">как раз</span>
Онегин выстрелил.`, buttons: [{name: 'Запятая нужна, это вводное словосочетание', ruleInfo: `«Как раз» — усилительная частица и никогда не выделяется запятыми.`, needed: false}, { name: 'Без запятой, это частица',  ruleInfo: `Запятая не нужна, «как раз» — усилительная частица и никогда не выделяется.`, needed: true}], helpMessage: '«Как раз», «только», «лишь» — усилительные частицы.', author: `А.С. Пушкин
«Евгений Онегин»`}
, {id: 8, questionText: `Промчалось много, много дней,
С тех пор <span class="highlightText">как юная Татьяна
И с ней Онегин в смутном сне
Явилися впервые мне.</span>`, correctText: `Промчалось много, много дней,
С тех пор <span class="highlightText">как юная Татьяна
И с ней Онегин в смутном сне
Явилися впервые мне.</span>`, buttons: [{name: 'Запятая нужна, это сложное предложение', ruleInfo: `Предложение сложное, но запятая не нужна, так как она уже стоит перед сложным союзом «с тех пор как».`, needed: false}, { name: 'Без запятой, это сложный союз',  ruleInfo: `Запятая не нужна, так как она уже стоит перед сложным союзом «с тех пор как». Если бы её не было, перед «как» нужна была бы запятая.`, needed: true}], helpMessage: 'Между частями этого сложного предложения уже стоит запятая.', author: `А.С. Пушкин
«Евгений Онегин»`}
, {id: 9, questionText: `Ты женишься, или я тебя прокляну, а имение <span class="highlightText">как бог свят</span> продам и промотаю!`, correctText: `Ты женишься, или я тебя прокляну, а имение, <span class="highlightText">как бог свят,</span> продам и промотаю!`, buttons: [{name: 'Запятая нужна, это вводное словосочетание', ruleInfo: `«Как бог свят», «вот те крест», «честное слово» — вводные словосочетания. Выделяются запятыми.`, needed: true}, { name: 'Без запятой, это частица',  ruleInfo: `«Как бог свят», «вот те крест», «честное слово» — вводные словосочетания. Выделяются запятыми.`, needed: false}], helpMessage: 'Вводные словосочетания «вот те крест», «честное слово» выражают уверенность говорящего.', author: `А.С. Пушкин
«Барышня-крестьянка»`}
, {id: 10, questionText: `Лучший стрелок, которого удалось мне встречать, стрелял каждый день, по крайней мере три раза перед обедом. Это у него было заведено <span class="highlightText">как рюмка водки.</span>`, correctText: `Лучший стрелок, которого удалось мне встречать, стрелял каждый день, по крайней мере три раза перед обедом. Это у него было заведено, <span class="highlightText">как рюмка водки.</span>`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Сравнительный оборот выделяется запятой.`, needed: true}, { name: 'Без запятой, это часть сказуемого',  ruleInfo: `Запятая нужна, так как это сравнительный оборот, а «заведено» — это сказуемое.`, needed: false}], helpMessage: 'Если удалить сравнение, смысл предложения по-прежнему будет понятен.', author: `А.С. Пушкин
«Выстрел»`}
, {id: 11, questionText: `Приказчика моего нашли на другой день в лесу, привязанного к дубу и ободранного <span class="highlightText">как липку.</span>`, correctText: `Приказчика моего нашли на другой день в лесу, привязанного к дубу и ободранного <span class="highlightText">как липку.</span>`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `«Ободрать как липку» — фразеологизм, пишется без запятой.`, needed: false}, { name: 'Без запятой, это фразеологизм',  ruleInfo: `«Ободрать как липку» — фразеологизм, пишется без запятой.`, needed: true}], helpMessage: 'Его ободрали как липку — и он стал гол как сокол.', author: `А.С. Пушкин
«Дубровский»`}
, {id: 12, questionText: `Вот уж 5 часов <span class="highlightText">как дожидается лошадей да свищет</span>. Надоел проклятый.`, correctText: `Вот уж 5 часов <span class="highlightText">как дожидается лошадей да свищет.</span> Надоел проклятый.`, buttons: [{name: 'Запятая нужна, сложное предложение', ruleInfo: `Запятая не ставится, потому что «как» — усилительная частица. `, needed: false}, { name: 'Без запятой, «как» — частица',  ruleInfo: `Запятая не ставится, потому что «как» — усилительная частица. `, needed: true}], helpMessage: 'Вот уж 5 часов всё дожидается лошадей да свищет.', author: `А.С. Пушкин
«Дубровский»`}
, {id: 13, questionText: `Руслан уныньем <span class="highlightText">как убит</span>;
Мысль о потерянной невесте
Его терзает и мертвит.`, correctText: `Руслан уныньем <span class="highlightText">как убит</span>;
Мысль о потерянной невесте
Его терзает и мертвит.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Это сказуемое, а запятая между подлежащим и сказуемым не ставится.`, needed: false}, { name: 'Без запятой, это сказуемое',  ruleInfo: `Запятая не нужна перед сказуемым. Проверка: если убрать «как убит» из предложения, смысл будет неясен.`, needed: true}], helpMessage: 'Предложение не потеряет смысла, если выбросить из него сравнение.', author: `А.С. Пушкин
«Руслан и Людмила»`}
, {id: 14, questionText: `Уж витязь под горой стоит,
Призывный рог <span class="highlightText">как буря</span> воет,
Нетерпеливый конь кипит
И снег копытом мочным роет.`, correctText: `Уж витязь под горой стоит,
Призывный рог, <span class="highlightText">как буря,</span> воет,
Нетерпеливый конь кипит
И снег копытом мочным роет.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Это сравнение, выделяется запятыми.`, needed: true}, { name: 'Без запятой, это фразеологизм',  ruleInfo: `Это сравнение, выделяется запятыми.`, needed: false}], helpMessage: 'Предложение потеряет смысла, если выбросить из него сказуемое.', author: `А.С. Пушкин
«Руслан и Людмила»`}
, {id: 15, questionText: `А их глазищи желтые
Горят <span class="highlightText">как воску ярого
Четырнадцать свечей!</span>`, correctText: `А их глазищи желтые
Горят, <span class="highlightText">как воску ярого
Четырнадцать свечей!</span>`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Это сравнение, выделяется запятыми.`, needed: true}, { name: 'Без запятой, значение «в качестве»',  ruleInfo: `Это сравнение, выделяется запятыми.`, needed: false}], helpMessage: 'Можно ли «как» заменить на «в качестве»?', author: `Н.А. Некрасов
«Кому на Руси жить хорошо»`}
, {id: 16, questionText: `Мой совет: обвенчаться <span class="highlightText">как можно скорее</span> в вашей деревянной церкви и приезжать к нам.`, correctText: `Мой совет: обвенчаться <span class="highlightText">как можно скорее</span> в вашей деревянной церкви и приезжать к нам.`, buttons: [{name: 'Запятая нужна, это сложное предложение', ruleInfo: `Наречные выражения «как можно скорее (...больше, выше)» не выделяются запятой.`, needed: false}, { name: 'Без запятой, это наречное выражение',  ruleInfo: `Наречные выражения «как можно скорее (...больше, выше)» не выделяются запятой.`, needed: true}], helpMessage: 'Наречные выражения «как можно скорее (...больше, выше)» не выделяются запятыми.', author: `А.С. Пушкин
«Роман в письмах»`}
, {id: 17, questionText: `Я не корчу английского лорда <span class="highlightText">как дипломат Северин</span> внук портного и повара.`, correctText: `Я не корчу английского лорда, <span class="highlightText">как дипломат Северин, внук портного и повара.</span>`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Это сравнение, выделяется запятыми.`, needed: true}, { name: 'Без запятой, значение причины',  ruleInfo: `Это сравнение, выделяется запятыми.`, needed: false}], helpMessage: 'Автор письма сравнивает себя с дипломатом Севериным.', author: `А.С. Пушкин
«Роман в письмах»`}
, {id: 18, questionText: `Сотни верст пустынной, однообразной, выгоревшей степи не могут нагнать такого уныния <span class="highlightText">как один человек,</span> когда он сидит, говорит и неизвестно, когда он уйдет.`, correctText: `Сотни верст пустынной, однообразной, выгоревшей степи не могут нагнать такого уныния, <span class="highlightText">как один человек</span>, когда он сидит, говорит и неизвестно, когда он уйдет.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Это сравнение, выделяется запятыми.`, needed: true}, { name: 'Без запятой, «как один» не выделяется',  ruleInfo: `Запятая нужна: «как один» входит в состав сравнения. Сравните: «Все работали как один».`, needed: false}], helpMessage: 'Автор сравнивает скучного человека с пустыней.', author: `А.П. Чехов
«Дом с мезонином»`}
, {id: 19, questionText: `Да, всё он делал не <span class="highlightText">как люди.</span>`, correctText: `Да, всё он делал <span class="highlightText">не как люди.</span>`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Запятая не ставится, еслт перед «как» стоит частица «не».`, needed: false}, { name: 'Без запятой, есть частица «не»',  ruleInfo: `Запятая не ставится, если перед «как» стоит частица «не».`, needed: true}], helpMessage: 'Даже тире между подлежащим и сказуемым не ставится, если есть частица «не».', author: `Максим Горький
«Исповедь»`}
, {id: 20, questionText: `По мнению здешних ученых, этот провал не что иное <span class="highlightText">как угасший кратер.</span>`, correctText: `По мнению здешних ученых, этот провал не что иное, <span class="highlightText">как угасший кратер.</span>`, buttons: [{name: 'Запятая всегда нужна в такой конструкции', ruleInfo: `Обороты «не что иное, как», «не кто другой, как» всегда выделяются запятыми.`, needed: true}, { name: 'Без запятой. «Не что иное как» не требует запятых',  ruleInfo: `Запятая нужна, потому что обороты «не что иное, как», «не кто другой, как» всегда выделяются запятыми.`, needed: false}], helpMessage: 'Это написал не кто иной, как Лермонтов.', author: `М.Ю. Лермонтов
«Герой нашего времени»`}
, {id: 21, questionText: `Честолюбие есть не что иное <span class="highlightText">как жажда власти.</span>`, correctText: `Честолюбие есть не что иное, <span class="highlightText">как жажда власти.</span>`, buttons: [{name: 'Запятая всегда нужна в такой конструкции', ruleInfo: `Обороты «не что иное, как», «не кто другой, как» всегда выделяются запятыми.`, needed: true}, { name: 'Без запятой. «Не что иное как» не требует запятых',  ruleInfo: `Запятая нужна, потому что обороты «не что иное, как», «не кто другой, как» всегда выделяются запятыми.`, needed: false}], helpMessage: 'Это написал не кто иной, как Лермонтов.', author: `М.Ю. Лермонтов
«Герой нашего времени»`}
, {id: 22, questionText: `Гость был не кто другой <span class="highlightText">как наш почтенный Павел Иванович Чичиков.</span>`, correctText: `Гость был не кто другой, <span class="highlightText">как наш почтенный Павел Иванович Чичиков.</span>`, buttons: [{name: 'Запятая всегда нужна в такой конструкции', ruleInfo: `Обороты «не что иное, как» «не кто другой, как» всегда выделяются запятыми.`, needed: true}, { name: 'Без запятой. «Не кто другой как» не требует запятых',  ruleInfo: `Запятая нужна, потому что обороты «не что иное, как» «не кто другой, как» всегда выделяются запятыми.`, needed: false}], helpMessage: 'Это написал не кто другой, как Гоголь.', author: `Н.В. Гоголь
«Мёртвые души»`}
, {id: 23, questionText: `Она была <span class="highlightText">как меньшая</span> любимица отца.`, correctText: `Она была, <span class="highlightText">как меньшая,</span> любимица отца.`, buttons: [{name: 'Запятая нужна, значение причины', ruleInfo: `Запятая ставится, если оборот с «как» означает причину.`, needed: true}, { name: 'Без запятой, значение приравнивания',  ruleInfo: `Запятая ставится, если оборот с «как» означает причину. Проверка: замените «как» на «будучи», смысл сохранится.`, needed: false}], helpMessage: 'Она была любимицей, потому что младшая.', author: `Л.Н. Толстой
«Анна Каренина»`}
, {id: 24, questionText: `Наш сад <span class="highlightText">как проходной двор.</span>`, correctText: `Наш сад <span class="highlightText">как проходной двор.</span>`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Запятая не ставится, если оборот с «как» входит в состав сказуемого.`, needed: false}, { name: 'Без запятой, это часть сказуемого',  ruleInfo: `Запятая ставится, если оборот с «как» входит в состав сказуемого. Обычно так бывает в предложениях без глаголов или с глаголами «был», «стал» и т.п.`, needed: true}], helpMessage: 'Есть ли глагол в этом предложении?', author: `А.П. Чехов
«Вишнёвый сад»`}
, {id: 25, questionText: `Богат, хорош собою, Ленский
Везде был принят <span class="highlightText">как жених.</span>`, correctText: `Богат, хорош собою, Ленский
Везде был принят <span class="highlightText">как жених.</span>`, buttons: [{name: 'Запятая нужна, значение причины', ruleInfo: `Запятая не ставится, если «как» можно заменить на «в качестве»`, needed: false}, { name: 'Без запятой, значение «в качестве»',  ruleInfo: `Запятая не ставится, если «как» можно заменить на «в качестве»`, needed: true}], helpMessage: 'Ленский везде был принят в качестве жениха.', author: `А.С. Пушкин
«Евгений Онегин»`}
, {id: 26, questionText: `Вас это <span class="highlightText">как будто</span> удивляет.`, correctText: `Вас это <span class="highlightText">как будто</span> удивляет.`, buttons: [{name: 'Запятая нужна, это вводное словосочетание.', ruleInfo: `Частица «как будто» никогда не выделяется запятыми.`, needed: false}, { name: 'Без запятой, это частица.',  ruleInfo: `Частица «как будто» никогда не выделяется запятыми.`, needed: true}], helpMessage: 'Частицы «как будто», «словно» не выделяются запятыми.', author: `И.С. Тургенев
«Отцы и дети»`}
, {id: 27, questionText: `И хотя этот зуб принадлежал к числу обыкновенных, однако Василий Иванович сохранил его <span class="highlightText">как редкость.</span>`, correctText: `И хотя этот зуб принадлежал к числу обыкновенных, однако Василий Иванович сохранил его <span class="highlightText">как редкость.</span>`, buttons: [{name: 'Запятая нужна, значение причины', ruleInfo: `Запятая не ставится, если «как» можно заменить на «в качестве».`, needed: false}, { name: 'Без запятой, значение «в качестве»',  ruleInfo: `Запятая не ставится, если «как» можно заменить на «в качестве».`, needed: true}], helpMessage: 'Он сохранил зуб не в качестве анатомического образца, а в качестве редкости. ', author: `И.С. Тургенев
«Отцы и дети»`}
, {id: 28, questionText: `Я сейчас вспомнил, что я еще не попросил у вас <span class="highlightText">как следует</span> прощения.`, correctText: `Я сейчас вспомнил, что я еще не попросил у вас <span class="highlightText">как следует</span> прощения.`, buttons: [{name: 'Запятая нужна, это вводное словосочетание', ruleInfo: `Устойчивое сочетание «как следует» никогда не выделяется запятой.`, needed: false}, { name: 'Без запятой, устойчивое сочетание',  ruleInfo: `Устойчивое сочетание «как следует» никогда не выделяется запятой. Для проверки можно заменить на «хорошенько», «в полной мере».`, needed: true}], helpMessage: 'Я ещё не попросил у вас прощения в полной мере.', author: `И.С. Тургенев
«Накануне»`}
, {id: 29, questionText: `Я посмотрел на нее <span class="highlightText">как дурак</span> — и вышел вон.`, correctText: `Я посмотрел на нее <span class="highlightText">как дурак</span> — и вышел вон.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Запятая не нужна, это устойчивое сочетание со значением обстоятельства.`, needed: false}, { name: 'Без запятой, устойчивое сочетание',  ruleInfo: `Запятая не нужна, это устойчивое сочетание со значением обстоятельства. Проверка: можно заменить одним словом: «глупо смотрел».`, needed: true}], helpMessage: 'Я посмотрел на неё глупо — и вышел.', author: `И.С. Тургенев
«Ася»`}
, {id: 30, questionText: `Старайтесь смотреть на меня <span class="highlightText">как на пациента</span>, одержимого болезнью, вам ещё неизвестной.`, correctText: `Старайтесь смотреть на меня <span class="highlightText">как на пациента</span>, одержимого болезнью, вам ещё неизвестной.`, buttons: [{name: 'Запятая нужна, это сравнение', ruleInfo: `Запятая не нужна, «как» в значении «в качестве»: «воспринимайте меня в качестве пациента».`, needed: false}, { name: 'Без запятой, значение «в качестве»',  ruleInfo: `Запятая не нужна, «как» в значении «в качестве». Проверка: «воспринимайте меня в качестве пациента».`, needed: true}], helpMessage: '«Как» в значении «в качестве» используют, когда хотят подчеркнуть одну сторону объекта: «Воспринимайте меня только в качестве пациента». ', author: `М. Ю. Лермонтов
«Герой нашего времени»`}
, {id: 31, questionText: `Вижу <span class="highlightText">как теперь</span> самого хозяина, человека лет пятидесяти, свежего и бодрого.`, correctText: `Вижу, <span class="highlightText">как теперь</span>, самого хозяина, человека лет пятидесяти, свежего и бодрого.`, buttons: [{name: 'Запятая нужна, устойчивое сочетание', ruleInfo: `Запятыми выделяются устойчивые сочетания «как теперь», «как всегда» и т.п.`, needed: true}, { name: 'Без запятой, надо запомнить',  ruleInfo: `Запятыми выделяются устойчивые сочетания «как теперь», «как всегда» и т.п.`, needed: false}], helpMessage: '«Как теперь», «как нарочно», «как назло» и другие устойчивые сочетания выделяются запятыми.', author: `А.С. Пушкин
«Станционный смотритель»`}
, {id: 32, questionText: `Экая досада! <span class="highlightText">Как нарочно</span> ни души!`, correctText: `Экая досада! <span class="highlightText">Как нарочно,</span> ни души!`, buttons: [{name: 'Запятая нужна, устойчивое сочетание', ruleInfo: `Запятыми выделяются устойчивые сочетания «как теперь», «как всегда» и т.п.`, needed: true}, { name: 'Без запятой, надо запомнить',  ruleInfo: `Запятыми выделяются устойчивые сочетания «как теперь», «как всегда» и т.п.`, needed: false}], helpMessage: '«Как теперь», «как нарочно», «как назло» и другие устойчивые сочетания выделяются запятыми.', author: `Н.В. Гоголь
«Ревизор»`}
, {id: 33, questionText: `Нигде при взаимной встрече не раскланиваются так благородно и непринуждённо <span class="highlightText">как на Невском проспекте.</span>`, correctText: `Нигде при взаимной встрече не раскланиваются так благородно и непринуждённо, <span class="highlightText">как на Невском проспекте.</span>`, buttons: [{name: 'Запятая всегда нужна в такой конструкции', ruleInfo: `Запятой всегда разделяются «так», «такой» и «как», если между ними есть другие слова.`, needed: true}, { name: 'Без запятой, есть «так»',  ruleInfo: `Запятой всегда разделяются «так», «такой» и «как», если между ними есть другие слова.`, needed: false}], helpMessage: 'Если есть слова «такой», «так», запятая нужна. ', author: `Н.В. Гоголь
«Невский проспект»`}
, {id: 34, questionText: `Герасиму <span class="highlightText">как отличному работнику</span> тут же дали метлу в руки.`, correctText: `Герасиму, <span class="highlightText">как отличному работнику</span>, тут же дали метлу в руки.`, buttons: [{name: 'Запятая нужна, значение причины', ruleInfo: `Запятая нужна, потому что оборот с «как» имеет значение причины.`, needed: true}, { name: 'Без запятой, значение «в качестве»',  ruleInfo: `
Запятая нужна, потому что оборот с «как» имеет значение причины. Сравните: «Герасиму дали метлу, потому что он был отличным работником».`, needed: false}], helpMessage: 'Герасиму дали метлу, потому что он был отличным работником.', author: `И.С. Тургенев
«Муму»`}
, {id: 35, questionText: `Чуть утро осветило пушки,
И леса синие верхушки,
Французы тут <span class="highlightText">как тут</span>.`, correctText: `Чуть утро осветило пушки,
И леса синие верхушки,
Французы тут <span class="highlightText">как тут</span>.`, buttons: [{name: 'Запятая нужна, фразеологизм.', ruleInfo: `Запятая не нужна, потому что «тут как тут» — сказуемое. Между подлежащим и сказуемым запятой быть не может.`, needed: false}, { name: 'Запятая не нужна, это сказуемое.',  ruleInfo: `Запятая не нужна, потому что «тут как тут» — сказуемое. Между подлежащим и сказуемым запятой быть не может.`, needed: true}], helpMessage: 'Фразеологизм «тут как тут» означает «появились», это сказуемое.', author: `М.Ю. Лермонтов
«Бородино»`}
, {id: 36, questionText: `<span class="highlightText">Как истинный француз</span> в кармане
Трике привез куплет Татьяне.`, correctText: `<span class="highlightText">Как истинный француз</span> в кармане
Трике привез куплет Татьяне.`, buttons: [{name: 'Запятая нужна, значение причины.', ruleInfo: `Запятая нужна, потому что оборот с «как» имеет значение причины.`, needed: true}, { name: 'Без запятой, это часть сказуемого.',  ruleInfo: `Запятая нужна, потому что оборот с «как» имеет значение причины. Проверка: «Он привёз куплет, потому что был французом».`, needed: false}], helpMessage: 'Трике привёз куплет, потому что был истинным французом и имел хорошие манеры', author: `А.С. Пушкин
«Евгений Онегин»`}
, {id: 37, questionText: `Если, по-твоему, всё это артисты, то я не знаю <span class="highlightText">как и говорить с тобой.</span> Разве это актеры? Самые настоящие посредственности!`, correctText: `Если, по-твоему, всё это артисты, то я не знаю <span class="highlightText">как и говорить с тобой.</span> Разве это актеры? Самые настоящие посредственности!`, buttons: [{name: 'Запятая нужна, сложное предложение', ruleInfo: `Запятая нужна, союз «как» соединяет две части сложного предложения.`, needed: true}, { name: 'Без запятой, устойчивое сочетание «не знаю как»',  ruleInfo: `Запятая нужна, союз «как» соединяет две части сложного предложения. Подсказка: перед «как и» всегда ставится запятая.`, needed: false}], helpMessage: 'Перед «как и» всегда ставится запятая.', author: `А.П. Чехов
«Критик»`}
, {id: 38, questionText: `Старый князь, <span class="highlightText">как и все отцы,</span> был особенно щепетилен насчет чести своих дочерей.`, correctText: `Старый князь, <span class="highlightText">как и все отцы,</span> был особенно щепетилен насчет чести своих дочерей.`, buttons: [{name: 'Запятая нужна, сложное предложение', ruleInfo: `Запятая нужна, союз «как» соединяет две части сложного предложения.`, needed: true}, { name: 'Без запятой, часть сказуемого',  ruleInfo: `Запятая нужна, союз «как» соединяет две части сложного предложения. Подсказка: перед «как и» всегда ставится запятая.`, needed: false}], helpMessage: 'Перед «как и» всегда ставится запятая.', author: `Л.Н. Толстой
«Анна Каренина»`}
, {id: 39, questionText: `А коли узнаю, что ты повел себя не <span class="highlightText">как сын Николая Болконского,</span> мне будет… стыдно!`, correctText: `А коли узнаю, что ты повел себя не <span class="highlightText">как сын Николая Болконского,</span> мне будет… стыдно!`, buttons: [{name: 'Запятая нужна, сравнение', ruleInfo: `Запятая не нужна, если есть частица «не» или слова «почти», «совершенно», «точь-в-точь».`, needed: false}, { name: 'Запятая не нужна, есть частица «не»',  ruleInfo: `Запятая не нужна, если есть частица «не» или слова «почти», «совершенно», «точь-в-точь».`, needed: true}], helpMessage: 'Когда есть частица «не», не ставится даже тире между подлежащим и сказуемым.', author: `Л.Н. Толстой
«Война и мир»`}
, {id: 40, questionText: `Князь Андрей бывал каждый день у Ростовых, но не <span class="highlightText">как жених</span> обращался с Наташей.`, correctText: `Князь Андрей бывал каждый день у Ростовых, но не <span class="highlightText">как жених</span> обращался с Наташей.`, buttons: [{name: 'Запятая нужна, значение причины', ruleInfo: `Запятая не нужна, если есть частица «не» или слова «почти», «совершенно», «точь-в-точь».`, needed: false}, { name: 'Запятая не нужна, есть частица «не»',  ruleInfo: `Запятая не нужна, если есть частица «не» или слова «почти», «совершенно», «точь-в-точь».`, needed: true}], helpMessage: 'Когда есть частица «не», не ставится даже тире между подлежащим и сказуемым.', author: `Л.Н. Толстой
«Война и мир»`}
, {id: 41, questionText: `Он почти <span class="highlightText">как ребенок,</span> впрочем образованный`, correctText: `Он почти <span class="highlightText">как ребенок,</span> впрочем образованный`, buttons: [{name: 'Запятая нужна, сравнение', ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «совершенно».`, needed: false}, { name: 'Запятая не нужна, есть «почти»',  ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «совершенно».`, needed: true}], helpMessage: 'Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «прямо».', author: `Ф.М. Достоевский
«Идиот»`}
, {id: 42, questionText: `После того <span class="highlightText">как Егорушка убежал от костра</span>, они сначала долго молчали.`, correctText: `После того <span class="highlightText">как Егорушка убежал от костра</span>, они сначала долго молчали.`, buttons: [{name: 'Запятая нужна, это сложное предложение', ruleInfo: `Запятая не нужна, потому что сложный союз «после того как» стоит в начале предложения.`, needed: false}, { name: 'Без запятой, это сложный союз',  ruleInfo: `Запятая не нужна, потому что сложный союз «после того как» стоит в начале предложения.`, needed: true}], helpMessage: 'Внутри сложных союзов «с тех пор как», «после того как» не нужна запятая, если они стоят в начале предложения.', author: `А.П. Чехов
«Степь»`}
, {id: 43, questionText: `Он был среди граждан совершенно <span class="highlightText">как в родной семье</span>, а в лавки и в гостиный двор наведывался, как в собственную кладовую.`, correctText: `Он был среди граждан совершенно <span class="highlightText">как в родной семье</span>, а в лавки и в гостиный двор наведывался, как в собственную кладовую.`, buttons: [{name: 'Запятая нужна, сравнение', ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «совершенно».`, needed: false}, { name: 'Запятая не нужна, есть «совершенно»',  ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «совершенно».`, needed: true}], helpMessage: 'Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «совершенно».', author: `Н.В. Гоголь
«Мёртвые души»`}
, {id: 44, questionText: `Ему помогали воспоминания его театральной карьеры — и он разыгрывал роль секунданта именно <span class="highlightText">как роль.</span>`, correctText: `Ему помогали воспоминания его театральной карьеры — и он разыгрывал роль секунданта именно <span class="highlightText">как роль.</span>`, buttons: [{name: 'Запятая нужна, сравнение', ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «именно».`, needed: false}, { name: 'Запятая не нужна, есть «именно»',  ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «именно».`, needed: true}], helpMessage: 'Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «вроде».', author: `И.С. Тургенев
«Вешние воды»`}
, {id: 45, questionText: `Жена – друг, ежели правильно вникнуть в дело. Она к тебе вроде <span class="highlightText">как цепью</span> на всю жизнь прикована.`, correctText: `Жена – друг, ежели правильно вникнуть в дело. Она к тебе вроде <span class="highlightText">как цепью</span> на всю жизнь прикована.`, buttons: [{name: 'Запятая нужна, сравнение', ruleInfo: `Запятая не нужна, если перед «как» стоят слова «вроде», «совсем», «именно».`, needed: false}, { name: 'Запятая не нужна, есть «вроде»',  ruleInfo: `Запятая не нужна, если перед «как» стоят слова «вроде», «совсем», «именно».`, needed: true}], helpMessage: 'Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «именно».', author: `Максим Горький
«Бывшие люди»`}
, {id: 46, questionText: `Можешь ли ты нарисовать такой портрет, чтобы был совершенно <span class="highlightText">как живой?</span>`, correctText: `Можешь ли ты нарисовать такой портрет, чтобы был совершенно <span class="highlightText">как живой?</span>`, buttons: [{name: 'Запятая нужна, сравнение', ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «совершенно».`, needed: false}, { name: 'Запятая не нужна, есть «совершенно»',  ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «совершенно».`, needed: true}], helpMessage: 'Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «прямо».', author: `Н.В. Гоголь
«Портрет»`}
, {id: 47, questionText: `Обшивка его была, правда, немного повреждена, но все же это был прекрасный стул и к тому же точь-в-точь <span class="highlightText">как первый.</span>`, correctText: `Обшивка его была, правда, немного повреждена, но все же это был прекрасный стул и к тому же точь-в-точь <span class="highlightText">как первый.</span>`, buttons: [{name: 'Запятая нужна, сравнение', ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «точь-в-точь», «совершенно».`, needed: false}, { name: 'Запятая не нужна, есть «точь-в-точь»',  ruleInfo: `Запятая не нужна, если перед «как» стоят слова «почти», «точь-в-точь», «совершенно».`, needed: true}], helpMessage: 'Запятая не нужна, если перед «как» стоят слова «почти», «совсем», «прямо».', author: `Илья Ильф, Евгений Петров
«Двенадцать стульев»`}
, {id: 48, questionText: `Но эта история ничто в сравнении с рассказом о молодости <span class="highlightText">как таковой.</span>`, correctText: `Но эта история ничто в сравнении с рассказом о молодости <span class="highlightText">как таковой.</span>`, buttons: [{name: 'Запятая нужна, уточняющий оборот', ruleInfo: `Запятая не ставится в местоименном обороте «как таковой».`, needed: false}, { name: 'Без запятой, местоименный оборот ',  ruleInfo: `Запятая не ставится в местоименном обороте «как таковой».`, needed: true}], helpMessage: 'Но эта история ничего в сравнении с рассказом о молодости самой по себе.', author: `Илья Ильф, Евгений Петров
«Преступление Якова»`}
, {id: 49, questionText: `Цензорам представляли не рукопись <span class="highlightText">как таковую,</span> а машинописный экземпляр, чтоб удобнее было читать и вносить правку.`, correctText: `Цензорам представляли не рукопись <span class="highlightText">как таковую,</span> а машинописный экземпляр, чтоб удобнее было читать и вносить правку.`, buttons: [{name: 'Запятая нужна, уточняющий оборот', ruleInfo: `Запятая не ставится в местоименном обороте «как таковой».`, needed: false}, { name: 'Без запятой, местоименный оборот ',  ruleInfo: `Запятая не ставится в местоименном обороте «как таковой».`, needed: true}], helpMessage: 'Цензорам предоставляли не рукопись саму по себе, а машинописный экземпляр.', author: `Илья Ильф, Евгений Петров
«Золотой телёнок»`}
, {id: 50, questionText: `С тех пор <span class="highlightText">как вечный судия
Мне дал всеведенье пророка,</span>
В очах людей читаю я
Страницы злобы и порока.`, correctText: `С тех пор <span class="highlightText">как вечный судия
Мне дал всеведенье пророка,</span>
В очах людей читаю я
Страницы злобы и порока.`, buttons: [{name: 'Запятая нужна, это сложное предложение', ruleInfo: `Запятая не нужна, потому что сложный союз «после того как» стоит в начале предложения.`, needed: false}, { name: 'Без запятой, это сложный союз',  ruleInfo: `Запятая не нужна, потому что сложный союз «после того как» стоит в начале предложения.`, needed: true}], helpMessage: 'Внутри сложных союзов «с тех пор как», «после того как» не нужна запятая, если они стоят в начале предложения.', author: `М.Ю. Лермонтов
«Пророк»`}
    ];

    const timerQuestions = [
      {id: 1, questionText: `Марья Гавриловна была воспитана на французских романах и <span class="highlightText">следственно</span> была влюблена.`, correctText: `Марья Гавриловна была воспитана на французских романах и, <span class="highlightText">следственно,</span> была влюблена.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводное слово означает порядок мыслей и выделяется запятыми.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Вводное слово означает порядок мыслей и выделяется запятыми.`, needed: false}], author: `А.С. Пушкин
«Метель»`}
, {id: 2, questionText: `Тебя тоской преследовать не буду,
Прошедшее <span class="highlightText">быть может</span> позабуду —
Не для меня сотворена любовь.`, correctText: `Тебя тоской преследовать не буду,
Прошедшее, <span class="highlightText">быть может,</span> позабуду —
Не для меня сотворена любовь.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводное словосочетание выражает неуверенность говорящего и выделяется запятыми.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Вводное словосочетание выражает неуверенность говорящего и выделяется запятыми.`, needed: false}], author: `А.С. Пушкин
«Всё кончено: меж нами связи нет...»`}
, {id: 3, questionText: `Ты прав: что <span class="highlightText">может быть</span> важней
На свете женщины прекрасной?`, correctText: `Ты прав: что <span class="highlightText">может быть</span> важней
На свете женщины прекрасной?`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятые не нужны, так как «может быть» — часть сказуемого.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятые не нужны, так как «может быть» — часть сказуемого, а не вводное. Проверка: нельзя выбросить из предложения без потери смысла.`, needed: true}], author: `А.С. Пушкин
«К Родзянке»`}
, {id: 4, questionText: `Старушка сидела <span class="highlightText">однажды</span> одна в гостиной, раскладывая гран-пасьянс.`, correctText: `Старушка сидела <span class="highlightText">однажды</span> одна в гостиной, раскладывая гран-пасьянс.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятые не нужны, наречие «однажды» — обстоятельство, а не вводное слово.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, наречие «однажды» — обстоятельство, а не вводное слово.`, needed: true}], author: `А.С. Пушкин
«Метель»`}
, {id: 5, questionText: `<span class="highlightText">Вот</span> какими путями распространяется просвещение!`, correctText: `<span class="highlightText">Вот</span> какими путями распространяется просвещение!`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, потому что «вот» — это указательная частица.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, потому что «вот» — это указательная частица.`, needed: true}], author: `А.С. Пушкин
«Барышня-крестьянка»`}
, {id: 6, questionText: `Пили по обыкновенному, <span class="highlightText">то есть</span> очень много`, correctText: `Пили по обыкновенному, <span class="highlightText">то есть</span> очень много`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, так как это союз.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, так как это союз.`, needed: true}], author: `А.С. Пушкин
«Выстрел»`}
, {id: 7, questionText: `Не понимаю, каким образом можно свататься, если знаешь <span class="highlightText">наверно</span>,
что не будет отказа`, correctText: `Не понимаю, каким образом можно свататься, если знаешь <span class="highlightText">наверно,</span> что не будет отказа`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, потому что «наверно» — обстоятельство.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, потому что «наверно» — обстоятельство. «Знаешь (как?) наверное».`, needed: true}], author: `А.С. Пушкин
из перевода «Участь моя решена»`}
, {id: 8, questionText: `Ах если б вас могла я ненавидеть!
<span class="highlightText">Однако ж</span> надобно расстаться нам.`, correctText: `Ах если б вас могла я ненавидеть!
<span class="highlightText">Однако ж</span> надобно расстаться нам.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, потому что здесь «однако» — союз, а не вводное слово.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, потому что здесь «однако» — союз, а не вводное слово. Проверка: можно заменить союзом «но».`, needed: true}], author: `А.С. Пушкин
«Каменный гость»`}
, {id: 9, questionText: `Жизнь его <span class="highlightText">наконец</span> была в моих руках`, correctText: `Жизнь его <span class="highlightText">наконец</span> была в моих руках`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна.«Наконец» может быть наречием, союзом или вводным словом. Здесь — наречие.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна.«Наконец» может быть наречием, союзом или вводным словом. Здесь — наречие.`, needed: true}], author: `А.С. Пушкин
«Выстрел»`}
, {id: 10, questionText: `<span class="highlightText">Между тем</span> я стал ходить взад и вперед, осматривая книги и картины.`, correctText: `<span class="highlightText">Между тем</span> я стал ходить взад и вперед, осматривая книги и картины.`, buttons: [{name: 'Нужны запятые', ruleInfo: `«Между тем» может быть наречием и союзом, но не может быть вводным словом. Запятыми не выделяется.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Неверно.
«Между тем» может быть наречием и союзом, но не может быть вводным словом. Запятыми не выделяется.`, needed: true}], author: `А.С. Пушкин
«Выстрел»`}
, {id: 11, questionText: `<span class="highlightText">Бывало</span> кто ни проедет, всякий похвалит, никто
не осудит.`, correctText: `<span class="highlightText">Бывало,</span> кто ни проедет, всякий похвалит, никто не осудит.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводное слово «бывало» означает оценку обычности того, о чём говорят.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна. Вводное слово «бывало» означает оценку обычности того, о чём говорят.`, needed: false}], author: `А.С. Пушкин
«Станционный смотритель»`}
, {id: 12, questionText: `Этот человек в футляре <span class="highlightText">можете себе представить</span> едва не женился.`, correctText: `Этот человек в футляре <span class="highlightText">можете себе представить</span> едва не женился.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводная конструкция «можете себе представить» помогает привлечь внимание собеседника.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `«Можете себе представить» — вводная конструкция, помогает привлечь внимание собеседника. Запятые нужны.`, needed: false}], author: `А.П. Чехов
«Человек в футляре»`}
, {id: 13, questionText: `<span class="highlightText">Действительно</span> я занимала его, и ему было весело смотреть на мой смех.`, correctText: `<span class="highlightText">Действительно,</span> я занимала его, и ему было весело смотреть на мой смех.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая нужна, потому что здесь «действительно» — вводное слово.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна, потому что здесь «действительно» — вводное слово. Проверка: стоит в начале предложения, можно выбросить без потери смысла.`, needed: false}], author: `Ф.М. Достоевский
«Неточка Незванова»`}
, {id: 14, questionText: `<span class="highlightText">Однако</span> долг вы понимаете прежде всего.`, correctText: `<span class="highlightText">Однако</span> долг, вы понимаете, прежде всего.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводная конструкция «вы понимаете» помогает привлечь внимание собеседника.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Вводная конструкция «вы понимаете» выделяется запятыми, помогает привлечь внимание собеседника.`, needed: false}], author: `И.С. Тургенев
«Уездный лекарь»`}
, {id: 15, questionText: `В чем счастие <span class="highlightText">по-вашему</span>?`, correctText: `В чем счастие, <span class="highlightText">по-вашему?</span>`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводное слово «по-вашему» выражает источник сообщения.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятая нужна, потому что «по-вашему» — вводное слово, называет источник сообщения`, needed: false}], author: `Н.А. Некрасов
«Кому на Руси жить хорошо»`}
, {id: 16, questionText: `Я  <span class="highlightText">признаюсь</span> не смел поднять очей.`, correctText: `Я, <span class="highlightText">признаюсь,</span> не смел поднять очей.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятыми выделяются вводные «признаюсь», «по совести», «смешно сказать».`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Запятыми выделяются вводные «признаюсь», «по совести», «смешно сказать».`, needed: false}], author: `А.С. Пушкин
«Борис Годунов»`}
, {id: 17, questionText: `<span class="highlightText">Ради бога</span> дай мне руку: я тону.`, correctText: `<span class="highlightText">Ради бога,</span> дай мне руку: я тону.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводное словосочетание «ради бога» выделяется запятыми.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Вводное словосочетание «ради бога» выделяется запятыми.`, needed: false}], author: `А.С. Пушкин
«Роман в письмах»`}
, {id: 18, questionText: `Поступок твоего рыцаря меня тронул <span class="highlightText">кроме шуток</span>.`, correctText: `Поступок твоего рыцаря меня тронул, <span class="highlightText">кроме шуток.</span>`, buttons: [{name: 'Нужны запятые', ruleInfo: `Вводные словосочетания «кроме шуток», «по сути», «правду сказать» выделяются запятыми.`, needed: true}, { name: 'Не нужны запятые',  ruleInfo: `Вводные словосочетания «кроме шуток», «по сути», «правду сказать» выделяются запятыми.`, needed: false}], author: `А.С. Пушкин
«Роман в письмах»`}
, {id: 19, questionText: `Легкомысленно непроницательны люди, и человек в другом кафтане <span class="highlightText">кажется им</span> другим человеком.`, correctText: `Легкомысленно непроницательны люди, и человек в другом кафтане <span class="highlightText">кажется им</span> другим человеком.`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, так как это сказуемое с дополнением.`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, потому что «кажется» — сказуемое.`, needed: true}], author: `Н.В. Гоголь
«Мёртвые души»`}
, {id: 20, questionText: `Ручаюсь вам если не за триумф, то <span class="highlightText">по крайней мере</span> за барыш...`, correctText: `Ручаюсь вам если не за триумф, то <span class="highlightText">по крайней мере</span> за барыш...`, buttons: [{name: 'Нужны запятые', ruleInfo: `Запятая не нужна, когда словосочетание «по крайней мере» можно заменить на «минимум», «не меньше, чем».`, needed: false}, { name: 'Не нужны запятые',  ruleInfo: `Запятая не нужна, когда словосочетание «по крайней мере» можно заменить на «минимум», «не меньше, чем».`, needed: true}], author: `А.С. Пушкин
«Египетские ночи»`}
    ];

    const dashQuestions = [
      {
        id: 1,
        questionText: `Театр уж полон; ложи блещут;
    Партер и кресла |+| все кипит.`,
        correctText: `Театр уж полон; ложи блещут;
    Партер и кресла — все кипит.`,
        trueRuleInfo: `Тире ставится перед обобщающим словом.`,
        falseRuleInfo: `Тире ставится перед обобщающим словом «всё», которое стоит после однородных членов предложения «партер» и «кресла».`,
        author: `А.С. Пушкин «Евгений Онегин»`
      },
      {
        id: 2,
        questionText: `Петр Петрович, по крайней мере по моим признакам, |+| человек весьма почтенный.`,
        correctText: `Петр Петрович, по крайней мере по моим признакам, человек весьма почтенный.`,
        trueRuleInfo: `Тире не ставится, так как между подлежащим и сказуемым есть вводная конструкция.`,
        falseRuleInfo: `Тире не ставится, так как между подлежащим и сказуемым есть вводная конструкция «по крайней мере по моим признакам».`,
        author: `Ф.М. Достоевский
    «Преступление и наказание»`
      },
      {
        id: 3,
        questionText: `Я |-| честный человек и никогда не говорю комплиментов.`,
        correctText: `Я честный человек и никогда не говорю комплиментов.`,
        trueRuleInfo: `Тире не ставится, так как подлежащее выражено местоимением.`,
        falseRuleInfo: `Тире не ставится, когда подлежащее выражено местоимением.`,
        author: `А.П. Чехов
    «Учитель»`
      },
      {
        id: 4,
        questionText: `Погода |-| несносная, дорога |-| скверная, ямщик |-| упрямый — а виноват смотритель.`,
        correctText: `Погода несносная, дорога скверная, ямщик упрямый — а виноват смотритель.`,
        trueRuleInfo: `Тире не ставится, так как сказуемое — прилагательное.`,
        falseRuleInfo: `Тире не ставится во всех частях предложения, так как сказуемые в них выражены прилагательными, а тире ставится между двумя существительными, глаголами или числительными.`,
        author: `А.С. Пушкин
    «Станционный смотритель»`
      },
      {
        id: 5,
        questionText: `Мы почитаем всех нулями, А единицами|-| себя.`,
        correctText: `Мы почитаем всех нулями, А единицами — себя.`,
        trueRuleInfo: `Тире ставится в неполном предложении.`,
        falseRuleInfo: `Часть предложения — неполная, в ней пропущено сказуемое «почитаем» и на его месте ставится тире.`,
        author: `А.С. Пушкин
    «Евгений Онегин»`
      },
      {
        id: 6,
        questionText: `А гений и злодейство |+|
    Две вещи несовместные. Не правда ль?`,
        correctText: `А гений и злодейство —
    Две вещи несовместные. Не правда ль?`,
        trueRuleInfo: `Тире ставится между подлежащим и сказуемым.`,
        falseRuleInfo: `Тире ставится между подлежащим и сказуемым, так как они выражены существительными.`,
        author: `А.С. Пушкин
    «Моцарт и Сольери»`
      },
      {
        id: 7,
        questionText: `Петербург |+|
    прихожая, Москва |+|
    девичья, деревня же |+|
    наш кабинет.`,
        correctText: `Петербург — прихожая, Москва — девичья, деревня же — наш кабинет.`,
        trueRuleInfo: `Тире ставится между подлежащим и сказуемым.`,
        falseRuleInfo: `Тире ставится между подлежащим и сказуемым, так как во всех случаях они выражены существительными. Частица «же» никак не влияет на постановку тире.`,
        author: `А.С. Пушкин
    «Роман в письмах»`
      },
      {
        id: 8,
        questionText: `Встретясь с этим человеком в лесу, вы приняли бы его за разбойника; в обществе |+|
    за политического заговорщика; в передней |+| за шарлатана, торгующего эликсирами и мышьяком.`,
        correctText: `Встретясь с этим человеком в лесу, вы приняли бы его за разбойника; в обществе — за политического заговорщика; в передней — за шарлатана, торгующего эликсирами и мышьяком.`,
        trueRuleInfo: `Тире ставится в неполном предложении.`,
        falseRuleInfo: `В обоих случаях перед нами неполные предложения. В них пропущены сказуемое «почитаем» и на его месте ставится тире.`,
        author: `А.С. Пушкин
    «Египетские ночи»`
      },
      {
        id: 9,
        questionText: `Я |-| раб, я |-| царь, я |-| червь, я |-| бог.`,
        correctText: `Я раб, я царь, я червь, я  бог.`,
        trueRuleInfo: `Тире не ставится, так как подлежащее выражено местоимением.`,
        falseRuleInfo: `Тире не ставится ни в одном из предложений, так как подлежащее выражено местоимением.`,
        author: `Г.Р. Державин
    «Бог»`
      },
      {
        id: 10,
        questionText: `Честолюбие |-| есть не что иное, как жажда власти.`,
        correctText: `Честолюбие есть не что иное, как жажда власти.`,
        trueRuleInfo: `Тире не ставится, так как есть связка «есть» и отрицательная частица «не».`,
        falseRuleInfo: `Тире не ставится, если между подлежащим и сказуемым стоит глагол-связка «есть».`,
        author: `М.Ю. Лермонтов
    «Герой нашего времени»`
      },
      {
        id: 11,
        questionText: `Тамань |+| самый скверный городишко из всех приморских городов России.`,
        correctText: `Тамань — самый скверный городишко из всех приморских городов России.`,
        trueRuleInfo: `Тире ставится между подлежащим и сказуемым, выраженными существительными.`,
        falseRuleInfo: `Тире ставится между подлежащим и сказуемым, выраженными существительными.`,
        author: `М.Ю. Лермонтов
    «Герой нашего времени»`
      },
      {
        id: 12,
        questionText: `Производить эффект |+| их наслаждение; они
    нравятся романтическим провинциалкам до безумия.`,
        correctText: `Производить эффект — их наслаждение; они
    нравятся романтическим провинциалкам до безумия.`,
        trueRuleInfo: `Тире ставится между подлежащим и сказуемым, выраженным существительным и глаголом.`,
        falseRuleInfo: `Тире ставится между подлежащим и сказуемым, выраженным существительным и глаголом.`,
        author: `М.Ю. Лермонтов
    «Герой нашего времени»`
      },
      {
        id: 13,
        questionText: `Его цель |+| сделаться героем романа. Он так часто старался уверить других в том, что он |-| существо,
    не созданное для мира, обреченное каким-то тайным страданиям, что он сам
    почти в этом уверился.`,
        correctText: `Его цель — сделаться
    героем романа. Он так часто старался уверить других в том, что он существо,
    не созданное для мира, обреченное каким-то тайным страданиям, что он сам
    почти в этом уверился.`,
        trueRuleInfo: `Тире ставится, когда подлежащее и сказуемое выражены существительным и глаголом, и не ставится, когда подлежащее — местоимение.`,
        falseRuleInfo: `Тире ставится, когда подлежащее и сказуемое выражены существительным и глаголом, и не ставится, когда подлежащее — местоимение.`,
        author: `М.Ю. Лермонтов
    «Герой нашего времени»`
      },
      {
        id: 14,
        questionText: `Обязанность |-| для меня дело священное, закон — я немею пред законом.`,
        correctText: `Обязанность для меня дело священное, закон — я немею пред законом.`,
        trueRuleInfo: `Тире не ставится, так как между подлежащим и сказуемым стоит дополнение «для меня».`,
        falseRuleInfo: `Тире не ставится, так как между подлежащим и сказуемым стоит дополнение «для меня».`,
        author: `Н.В. Гоголь
    «Мёртвые души»`
      },
      {
        id: 15,
        questionText: `Отчизна |-| есть то, что ищет душа наша, что милее для нее всего. Отчизна моя |+| ты.`,
        correctText: `Отчизна есть то, что ищет душа наша, что милее для нее всего. Отчизна моя — ты.`,
        trueRuleInfo: `Тире не ставится, если в предложении есть слово «есть». Обычно тире не ставится в предложениях с местоимением, но его можно использовать для особой экспрессии.`,
        falseRuleInfo: `Тире не ставится, если в предложении есть слово «есть». Обычно тире не ставится в предложениях с местоимением, но его можно использовать для особой экспрессии.`,
        author: `Н.В. Гоголь
    «Тарас Бульба»`
      },
      {
        id: 16,
        questionText: `Экипажи, дом, отлично устроенный, вкусные обеды |+| вот что беспрерывно носилось в голове его.`,
        correctText: `Экипажи, дом, отлично устроенный, вкусные обеды — вот что беспрерывно носилось в голове его.`,
        trueRuleInfo: `Тире ставится перед обобщающим словом «что».`,
        falseRuleInfo: `Тире ставится перед обобщающим словом «что».`,
        author: `Н.В. Гоголь
    «Мёртвые души»`
      },
      {
        id: 17,
        questionText: `Они смотрели друг на друга: Райский |+| с холодным любопытством, она |+| с дерзким торжеством.`,
        correctText: `Они смотрели друг на друга: Райский — с холодным любопытством, она — с дерзким торжеством.`,
        trueRuleInfo: `Тире ставится в обоих случаях на месте пропущенного сказуемого «смотрели».`,
        falseRuleInfo: `Тире ставится в обоих случаях на месте пропущенного сказуемого «смотрели».`,
        author: `И.А. Гончаров
    «Обломов»`
      },
      {
        id: 18,
        questionText: `Мысль изречённая |-| есть ложь.`,
        correctText: `Мысль изречённая есть ложь.`,
        trueRuleInfo: `Тире не ставится, если в предложении есть глагол «есть».`,
        falseRuleInfo: `Тире не ставится, если в предложении есть глагол «есть».`,
        author: `Ф.И. Тютчев
    «Silentium!»`
      },
      {
        id: 19,
        questionText: `Поэзия —
    Не профессия,
    Поэзия |-| как любовь.`,
        correctText: `Поэзия —
    Не профессия,
    Поэзия как любовь.`,
        trueRuleInfo: `Тире не ставится, если есть отрицание «не».`,
        falseRuleInfo: `Тире не ставится, если есть отрицание «не».`,
        author: `В.Д. Фёдоров
    «Поэзия — не профессия...»`
      },
      {
        id: 20,
        questionText: `Я не знал, что любовь |+| зараза,
    Я не знал, что любовь |+| чума.
    Подошла и прищуренным глазом
    Хулигана свела с ума.`,
        correctText: `Я не знал, что любовь — зараза,
    Я не знал, что любовь — чума.
    Подошла и прищуренным глазом
    Хулигана свела с ума.`,
        trueRuleInfo: `Тире ставится, когда подлежащее и сказуемое выражены существительными.`,
        falseRuleInfo: `Тире ставится, когда подлежащее и сказуемое выражены существительными.`,
        author: `С.Есенин
    «Пой же, пой. На проклятой гитаре...»`
      },
      {
        id: 21,
        questionText: `Песня с бурей |-| вечно сестры.`,
        correctText: `Песня с бурей вечно сестры.`,
        trueRuleInfo: `Тире не ставится, когда между подлежащим и сказуемым стоит обстоятельство.`,
        falseRuleInfo: `Тире не ставится, потому что между подлежащим и сказуемым стоит обстоятельство «вечно».`,
        author: `В. Брюсов
    «Кинжал»`
      }
    ];

    return { commaQuestions, timerQuestions, dashQuestions };
  }

  // Overrides the genId method to ensure that a item always has an id.
  // If the array is empty,
  // the method below returns the initial number (1).
  // if the array is not empty, the method below returns the highest
  // item id + 1.
  genId(questions: Question[]): number {
    return questions.length > 0 ? Math.max(...questions.map(question => question.id)) + 1 : 1;
  }
}
