import { Question } from './question';
import { InMemoryDbService } from 'angular-in-memory-web-api';
import { Injectable } from '@angular/core';

// tslint:disable:max-line-length
@Injectable({
  providedIn: 'root'
})
export class InMemoryDataService implements InMemoryDbService {
  createDb() {
    const commaQuestions = [
      {
        id: 1,
        questionText: `Виконт был подан обществу в самом изящном и выгодном для него свете <span class="highlightText">как ростбиф на горячем блюде, посыпанный зеленью.</span>`,
        correctText: `Виконт был подан обществу в самом изящном и выгодном для него свете,
<span class="highlightText">как ростбиф на горячем блюде, посыпанный зеленью.</span>`,
        trueBtnText: 'Запятая нужна, это сравнение.',
        falseBtnText: 'Без запятой, это сказуемое.',
        needCommas: true,
        trueRuleInfo: `Запятая нужна, потому что это сравнения.`,
        falseRuleInfo: `Запятая нужна, потому что это сравнение.`,
        helpMessage: 'Автор сравнивает виконта с ростбифом, сказуемое — «был подан».',
        author: `Л. Н. Толстой
«Война и мир»`
      },
      {
        id: 2,
        questionText: `Ничто так не нужно молодому человеку <span class="highlightText">как общество умных женщин</span>.`,
        correctText: `Ничто так не нужно молодому человеку, <span class="highlightText">как общество умных женщин.</span>`,
        trueBtnText: 'Запятая всегда нужна в такой конструкции.',
        falseBtnText: 'Без запятой, значение «в качестве».',
        needCommas: true,
        trueRuleInfo: `Запятая всегда нужна в конструкциях «Ничто так не… , как».`,
        falseRuleInfo: `Запятая всегда нужна в конструкциях «Ничто так не… , как».`,
        helpMessage:
          'Если в первой части предложения есть слово «так», «такой», «тот», то запятая всегда ставится. Кроме случаев с союзом «так как».',
        author: `Л. Н. Толстой
«Война и мир»`
      },
      {
        id: 3,
        questionText: `Пьер был неуклюж. Он <span class="highlightText">как говорится</span> не умел войти в салон и еще менее умел из него выйти.`,
        correctText: `Пьер был неуклюж. Он, <span class="highlightText">как говорится,</span> не умел войти в салон и еще менее умел из него выйти.`,
        trueBtnText: 'Запятая нужна, это вводное словосочетание.',
        falseBtnText: 'Без запятой, это фразеологизм.',
        needCommas: true,
        trueRuleInfo: `«Как говорится» — вводная конструкция и выделяется запятыми.`,
        falseRuleInfo: `«Как говорится» — вводная конструкция и выделяется запятыми.`,
        helpMessage: 'Запятыми выделяются вводные словосочетания «как говорят», «как водится», «как всегда» и т.п.',
        author: `Л. Н. Толстой
«Война и мир»`
      },
      {
        id: 4,
        questionText: `Москве больше делать нечего <span class="highlightText">как сплетничать</span>.`,
        correctText: `Москве больше делать нечего, <span class="highlightText">как сплетничать.</span>`,
        trueBtnText: 'Запятая нужна',
        falseBtnText: 'Без запятой',
        needCommas: true,
        trueRuleInfo: ``,
        falseRuleInfo: ``,
        helpMessage: '',
        author: `Л. Н. Толстой
«Война и мир»`
      },
      {
        id: 5,
        questionText: `Француз стоял <span class="highlightText">как вкопанный</span>.`,
        correctText: `Француз стоял <span class="highlightText">как вкопанный.</span>`,
        trueBtnText: 'Запятая нужна, это сравнение.',
        falseBtnText: 'Без запятой, это фразеологизм.',
        needCommas: false,
        trueRuleInfo: `«Стоял как вкопанный» — фразеологизм, пишется без запятой.`,
        falseRuleInfo: `«Стоял как вкопанный» — фразеологизм, пишется без запятой.`,
        helpMessage: 'Француз свалился как снег на голову.',
        author: `А.С. Пушкин
«Дубровский»`
      },
      {
        id: 6,
        questionText: `Один Иван Петрович был <span class="highlightText">как дома</span>: ел за двоих, пил в свою меру, смеялся своему смеху.`,
        correctText: `Один Иван Петрович был <span class="highlightText">как дома</span>: ел за двоих, пил в свою меру, смеялся своему смеху.`,
        trueBtnText: 'Запятая нужна, есть значение причины.',
        falseBtnText: 'Без запятой, это часть сказуемого.',
        needCommas: false,
        trueRuleInfo: `Сказуемое — «был как дома», а запятой внутри сказуемого быть не может.`,
        falseRuleInfo: `Сказуемое — «был как дома», а запятой внутри сказуемого быть не может.`,
        helpMessage: 'Будет ли предложение понятным без этого словосочетания?',
        author: `А.С. Пушкин
«Барышня-крестьянка»`
      },
      {
        id: 7,
        questionText: `И Ленский, жмуря левый глаз
Стал тоже целить, но <span class="highlightText">как раз</span>
Онегин выстрелил.`,
        correctText: `И Ленский, жмуря левый глаз
Стал тоже целить, но <span class="highlightText">как раз</span>
Онегин выстрелил.`,
        trueBtnText: 'Запятая нужна, это вводное словосочетание.',
        falseBtnText: 'Без запятой, это частица.',
        needCommas: false,
        trueRuleInfo: `«Как раз» — усилительная частица и никогда не выделяется запятыми.`,
        falseRuleInfo: `Запятая не нужна, «как раз» — усилительная частица и никогда не выделяется.`,
        helpMessage: '«Как раз», «только», «лишь» — усилительные частицы.',
        author: `А.С. Пушкин
«Евгений Онегин»`
      },
      {
        id: 8,
        questionText: `Промчалось много, много дней,
С тех пор <span class="highlightText">как юная Татьяна
И с ней Онегин в смутном сне
Явилися впервые мне.</span>`,
        correctText: `Промчалось много, много дней,
С тех пор <span class="highlightText">как юная Татьяна
И с ней Онегин в смутном сне
Явилися впервые мне.</span>`,
        trueBtnText: 'Запятая нужна, это сложное предложение.',
        falseBtnText: 'Без запятой, это сложный союз.',
        needCommas: false,
        trueRuleInfo: `Предложение сложное, но запятая не нужна, так как она уже стоит перед сложным союзом «с тех пор как».`,
        falseRuleInfo: `Запятая не нужна, так как она уже стоит перед сложным союзом «с тех пор как». Если бы её не было, перед «как» нужна была бы запятая.`,
        helpMessage: 'Между частями этого сложного предложения уже стоит запятая.',
        author: `А.С. Пушкин
«Евгений Онегин»`
      },
      {
        id: 9,
        questionText: `Ты женишься, или я тебя прокляну, а имение <span class="highlightText">как бог свят</span> продам и
промотаю!`,
        correctText: `Ты женишься, или я тебя прокляну, а имение, <span class="highlightText">как бог свят,</span> продам и промотаю!`,
        trueBtnText: 'Запятая нужна, это вводное словосочетание.',
        falseBtnText: 'Без запятой, это частица. ',
        needCommas: true,
        trueRuleInfo: `«Как бог свят», «вот те крест», «честное слово» — вводные словосочетания. Выделяются запятыми.`,
        falseRuleInfo: `«Как бог свят», «вот те крест», «честное слово» — вводные словосочетания. Выделяются запятыми.`,
        helpMessage: 'Вводные словосочетания «вот те крест», «честное слово» выражают уверенность говорящего.',
        author: `А.С. Пушкин
«Барышня-крестьянка»`
      },
      {
        id: 10,
        questionText: `Лучший стрелок, которого удалось мне встречать, стрелял каждый день, по крайней
мере три раза перед обедом. Это у него было заведено <span class="highlightText">как рюмка водки.</span>`,
        correctText: `Лучший
стрелок, которого удалось мне встречать, стрелял каждый день, по крайней
мере три раза перед обедом. Это у него было заведено, <span class="highlightText">как рюмка водки.</span>`,
        trueBtnText: 'Запятая нужна, это сравнение.',
        falseBtnText: 'Без запятой, это часть сказуемого.',
        needCommas: true,
        trueRuleInfo: `Сравнительный оборот выделяется запятой.`,
        falseRuleInfo: `Запятая нужна, так как это сравнительный оборот, а «заведено» — это сказуемое.`,
        helpMessage: 'Если удалить сравнение, смысл предложения по-прежнему будет понятен.',
        author: `А.С. Пушкин
«Выстрел»`
      },
      {
        id: 11,
        questionText: `Приказчика моего
нашли на другой день в лесу, привязанного к дубу и ободранного <span class="highlightText">как липку.</span>`,
        correctText: `Приказчика моего
нашли на другой день в лесу, привязанного к дубу и ободранного <span class="highlightText">как липку.</span>`,
        trueBtnText: 'Запятая нужна, это сравнение.',
        falseBtnText: 'Без запятой, это фразеологизм. ',
        needCommas: false,
        trueRuleInfo: `«Ободрать как липку» — фразеологизм, пишется без запятой.`,
        falseRuleInfo: `«Ободрать как липку» — фразеологизм, пишется без запятой.`,
        helpMessage: 'Его ободрали как липку — и он стал гол как сокол.',
        author: `А.С. Пушкин
«Дубровский»`
      },
      {
        id: 12,
        questionText: `Вот уж 5 часов <span class="highlightText">как дожидается лошадей да свищет</span>. Надоел проклятый.`,
        correctText: `Вот уж 5 часов <span class="highlightText">как дожидается лошадей да свищет.</span> Надоел проклятый.`,
        trueBtnText: 'Запятая нужна',
        falseBtnText: 'Без запятой',
        needCommas: false,
        trueRuleInfo: ``,
        falseRuleInfo: ``,
        helpMessage: '',
        author: `А.С. Пушкин
«Дубровский»`
      },
      {
        id: 13,
        questionText: `Руслан уныньем <span class="highlightText">как убит</span>;
Мысль о потерянной невесте
Его терзает и мертвит.`,
        correctText: `Руслан уныньем <span class="highlightText">как убит;</span>
Мысль о потерянной невесте
Его терзает и мертвит.`,
        trueBtnText: 'Запятая нужна, это сравнение.',
        falseBtnText: 'Без запятой, это сказуемое. ',
        needCommas: false,
        trueRuleInfo: `Это сказуемое, а запятая между подлежащим и сказуемым не ставится.`,
        falseRuleInfo: `
Запятая не нужна перед сказуемым. Проверка: если убрать «как убит» из предложения, смысл будет неясен.`,
        helpMessage: 'Предложение не потеряет смысла, если выбросить из него сравнение.',
        author: `А.С. Пушкин
«Руслан и Людмила»`
      },
      {
        id: 14,
        questionText: `Уж витязь под горой стоит,
Призывный рог <span class="highlightText">как буря</span> воет,
Нетерпеливый конь кипит
И снег копытом мочным роет.`,
        correctText: `Уж витязь под горой стоит,
Призывный рог, <span class="highlightText">как буря,</span> воет,
Нетерпеливый конь кипит
И снег копытом мочным роет.`,
        trueBtnText: 'Запятая нужна, это сравнение.',
        falseBtnText: 'Без запятой, это фразеологизм. ',
        needCommas: true,
        trueRuleInfo: `Это сравнение, выделяется запятыми.`,
        falseRuleInfo: `
Это сравнение, выделяется запятыми.`,
        helpMessage: 'Предложение потеряет смысла, если выбросить из него сказуемое.',
        author: `А.С. Пушкин
«Руслан и Людмила»`
      },
      {
        id: 15,
        questionText: `А их глазищи желтые
Горят <span class="highlightText">как воску ярого
Четырнадцать свечей!</span>`,
        correctText: `А их глазищи желтые
Горят, <span class="highlightText">как воску ярого
Четырнадцать свечей!</span>`,
        trueBtnText: 'Запятая нужна, это сравнение.',
        falseBtnText: 'Без запятой, значение «в качестве».',
        needCommas: true,
        trueRuleInfo: `Это сравнение, выделяется запятыми.`,
        falseRuleInfo: `Это сравнение, выделяется запятыми.`,
        helpMessage: 'Можно ли «как» заменить на «в качестве»?',
        author: `Н.А. Некрасов
«Кому на Руси жить хорошо»`
      },
      {
        id: 16,
        questionText: `Мой совет: обвенчаться <span class="highlightText">как можно скорее</span> в вашей деревянной церкви и приезжать к нам.`,
        correctText: `Мой совет: обвенчаться <span class="highlightText">как можно скорее</span> в вашей деревянной церкви и приезжать к нам.`,
        trueBtnText: 'Запятая нужна, это сложное предложение.',
        falseBtnText: 'Без запятой, это наречное выражение.',
        needCommas: false,
        trueRuleInfo: `Наречные выражения «как можно скорее (...больше, выше)» не выделяются запятой.`,
        falseRuleInfo: `Наречные выражения «как можно скорее (...больше, выше)» не выделяются запятой.`,
        helpMessage: 'Наречные выражения «как можно скорее (...больше, выше)» не выделяются запятыми.',
        author: `А.С. Пушкин
«Роман в письмах»`
      },
      {
        id: 17,
        questionText: `Я не корчу английского лорда <span class="highlightText">как дипломат Северин</span> внук портного и повара.`,
        correctText: `Я не корчу английского лорда, <span class="highlightText">как дипломат Северин, внук портного и повара.</span>`,
        trueBtnText: 'Запятая нужна, это сравнение.',
        falseBtnText: 'Без запятой, значение причины. ',
        needCommas: true,
        trueRuleInfo: `Это сравнение, выделяется запятыми.`,
        falseRuleInfo: `Это сравнение, выделяется запятыми.`,
        helpMessage: 'Автор письма сравнивает себя с дипломатом Севериным.',
        author: `А.С. Пушкин
«Роман в письмах»`
      },
      {
        id: 18,
        questionText: `Сотни верст пустынной, однообразной, выгоревшей степи не могут нагнать такого уныния
<span class="highlightText">как один человек,</span> когда он сидит, говорит и неизвестно, когда он уйдет.`,
        correctText: `Сотни верст пустынной, однообразной, выгоревшей степи не могут нагнать такого уныния,
<span class="highlightText">как один человек</span>, когда он сидит, говорит и неизвестно, когда он уйдет.`,
        trueBtnText: 'Запятая нужна',
        falseBtnText: 'Без запятой',
        needCommas: true,
        trueRuleInfo: ``,
        falseRuleInfo: ``,
        helpMessage: '',
        author: `А.П. Чехов
«Дом с мезонином»`
      },
      {
        id: 19,
        questionText: `Да, всё он делал не <span class="highlightText">как люди.</span>`,
        correctText: `Да, всё он делал не <span class="highlightText">как люди.</span>`,
        trueBtnText: 'Запятая нужна',
        falseBtnText: 'Без запятой',
        needCommas: false,
        trueRuleInfo: ``,
        falseRuleInfo: ``,
        helpMessage: '',
        author: `Максим Горький
«Исповедь»`
      },
      {
        id: 20,
        questionText: `По мнению здешних ученых, этот провал не что иное <span class="highlightText">как угасший кратер.</span>`,
        correctText: `По мнению здешних ученых, этот провал не что иное, <span class="highlightText">как угасший кратер.</span>`,
        trueBtnText: 'Запятая нужна',
        falseBtnText: 'Без запятой',
        needCommas: true,
        trueRuleInfo: ``,
        falseRuleInfo: ``,
        helpMessage: '',
        author: `М.Ю. Лермонтов
«Герой нашего времени»`
      },
      {
        id: 21,
        questionText: `Честолюбие есть не что иное <span class="highlightText">как жажда власти.</span>`,
        correctText: `Честолюбие есть не что иное, <span class="highlightText">как жажда власти.</span>`,
        trueBtnText: 'Запятая нужна',
        falseBtnText: 'Без запятой',
        needCommas: true,
        trueRuleInfo: ``,
        falseRuleInfo: ``,
        helpMessage: '',
        author: `М.Ю. Лермонтов
«Герой нашего времени»`
      },
      {
        id: 22,
        questionText: `Гость был не кто другой <span class="highlightText">как наш почтенный Павел Иванович Чичиков.</span>`,
        correctText: `Гость был не кто другой, <span class="highlightText">как наш почтенный Павел Иванович Чичиков.</span>`,
        trueBtnText: 'Запятая нужна',
        falseBtnText: 'Без запятой',
        needCommas: true,
        trueRuleInfo: ``,
        falseRuleInfo: ``,
        helpMessage: '',
        author: `Н.В. Гоголь
«Мёртвые души»`
      },
      {
        id: 23,
        questionText: `Она была <span class="highlightText">как меньшая</span> любимица отца.`,
        correctText: `Она была, <span class="highlightText">как меньшая,</span> любимица отца.`,
        trueBtnText: 'Запятая нужна',
        falseBtnText: 'Без запятой',
        needCommas: true,
        trueRuleInfo: ``,
        falseRuleInfo: ``,
        helpMessage: '',
        author: `Л.Н. Толстой
«Анна Каренина»`
      },
      {
        id: 24,
        questionText: `Итак, я вам советую <span class="highlightText">как приятель</span> быть осторожнее.`,
        correctText: `Итак, я вам советую <span class="highlightText">как приятель</span> быть осторожнее.`,
        trueBtnText: 'Запятая нужна',
        falseBtnText: 'Без запятой',
        needCommas: false,
        trueRuleInfo: ``,
        falseRuleInfo: ``,
        helpMessage: '',
        author: `М.Ю. Лермонтов
«Герой нашего времени»`
      },
      {
        id: 25,
        questionText: `Богат, хорош собою, Ленский Везде был принят <span class="highlightText">как жених.</span>`,
        correctText: `Богат, хорош собою, Ленский Везде был принят <span class="highlightText">как жених.</span>`,
        trueBtnText: 'Запятая нужна, значение «будучи»',
        falseBtnText: 'Без запятой, значение «в качестве»',
        needCommas: false,
        trueRuleInfo: ``,
        falseRuleInfo: ``,
        helpMessage: '',
        author: `А.С. Пушкин
«Евгений Онегин»`
      }
    ];

    const timerQuestions = [
      {
        id: 1,
        questionText: `Марья Гавриловна была воспитана на французских романах и <span class="highlightText">следственно</span> была влюблена.`,
        correctText: `Марья Гавриловна была воспитана на французских романах и, <span class="highlightText">следственно,</span> была влюблена.`,
        needCommas: true,
        trueRuleInfo: `Вводное слово означает порядок мыслей и выделяется запятыми.`,
        falseRuleInfo: `Вводное слово означает порядок мыслей и выделяется запятыми.`,
        author: `А.С. Пушкин
    «Метель»`
      },
      {
        id: 2,
        questionText: `Тебя тоской преследовать не буду,
    Прошедшее <span class="highlightText">быть может</span> позабуду —
    Не для меня сотворена любовь.`,
        correctText: `Тебя тоской преследовать не буду,
    Прошедшее, <span class="highlightText">быть может,</span> позабуду —
    Не для меня сотворена любовь.`,
        needCommas: true,
        trueRuleInfo: `Вводное словосочетание выражает неуверенность говорящего и выделяется запятыми.`,
        falseRuleInfo: `Вводное словосочетание выражает неуверенность говорящего и выделяется запятыми.`,
        author: `А.С. Пушкин
    «Всё кончено: меж нами связи нет...»`
      },
      {
        id: 3,
        questionText: `Ты прав: что <span class="highlightText">может быть</span> важней
    На свете женщины прекрасной?`,
        correctText: `Ты прав: что <span class="highlightText">может быть</span> важней
    На свете женщины прекрасной?`,
        needCommas: false,
        trueRuleInfo: `Запятые не нужны, так как «может быть» — часть сказуемого.`,
        falseRuleInfo: `Запятые не нужны, так как «может быть» — часть сказуемого, а не вводное. Проверка: нельзя выбросить из предложения без потери смысла.`,
        author: `А.С. Пушкин
    «К Родзянке»`
      },
      {
        id: 4,
        questionText: `Старушка сидела <span class="highlightText">однажды</span> одна в гостиной, раскладывая гран-пасьянс.`,
        correctText: `Старушка сидела <span class="highlightText">однажды</span> одна в гостиной, раскладывая гран-пасьянс.`,
        needCommas: false,
        trueRuleInfo: `Запятые не нужны, наречие «однажды» — обстоятельство, а не вводное слово.`,
        falseRuleInfo: `Запятая не нужна, наречие «однажды» — обстоятельство, а не вводное слово.`,
        author: `А.С. Пушкин
    «Метель»`
      },
      {
        id: 5,
        questionText: `<span class="highlightText">Вот</span> какими путями распространяется просвещение!`,
        correctText: `<span class="highlightText">Вот</span> какими путями распространяется просвещение!`,
        needCommas: false,
        trueRuleInfo: `Запятая не нужна, потому что «вот» — это указательная частица.`,
        falseRuleInfo: `Запятая не нужна, потому что «вот» — это указательная частица.`,
        author: `А.С. Пушкин
    «Барышня-крестьянка»`
      },
      {
        id: 6,
        questionText: `Пили по обыкновенному, <span class="highlightText">то есть</span> очень много`,
        correctText: `Пили по обыкновенному, <span class="highlightText">то есть</span> очень много`,
        needCommas: false,
        trueRuleInfo: `Запятая не нужна, так как это союз.`,
        falseRuleInfo: `Запятая не нужна, так как это союз.`,
        author: `А.С. Пушкин
    «Выстрел»`
      },
      {
        id: 7,
        questionText: `Не понимаю, каким образом можно свататься, если знаешь <span class="highlightText">наверно</span>,
    что не будет отказа`,
        correctText: `Не понимаю, каким образом можно свататься, если знаешь <span class="highlightText">наверно,</span> что не будет отказа`,
        needCommas: false,
        trueRuleInfo: `Запятая не нужна, потому что «наверно» — обстоятельство.`,
        falseRuleInfo: `Запятая не нужна, потому что «наверно» — обстоятельство. «Знаешь (как?) наверное».`,
        author: `А.С. Пушкин
    из перевода «Участь моя решена»`
      },
      {
        id: 8,
        questionText: `Ах если б вас могла я ненавидеть!
    <span class="highlightText">Однако ж</span> надобно расстаться нам.`,
        correctText: `Ах если б вас могла я ненавидеть!
    <span class="highlightText">Однако ж</span> надобно расстаться нам.`,
        needCommas: false,
        trueRuleInfo: `Запятая не нужна, потому что здесь «однако» — союз, а не вводное слово.`,
        falseRuleInfo: `Запятая не нужна, потому что здесь «однако» — союз, а не вводное слово. Проверка: можно заменить союзом «но».`,
        author: `А.С. Пушкин
    «Каменный гость»`
      },
      {
        id: 9,
        questionText: `Жизнь его <span class="highlightText">наконец</span> была в моих руках`,
        correctText: `Жизнь его <span class="highlightText">наконец</span> была в моих руках`,
        needCommas: false,
        trueRuleInfo: `Запятая не нужна.«Наконец» может быть наречием, союзом или вводным словом. Здесь — наречие.`,
        falseRuleInfo: `Запятая не нужна.«Наконец» может быть наречием, союзом или вводным словом. Здесь — наречие.`,
        author: `А.С. Пушкин
    «Выстрел»`
      },
      {
        id: 10,
        questionText: `<span class="highlightText">Между тем</span> я стал ходить взад и вперед, осматривая книги и картины.`,
        correctText: `<span class="highlightText">Между тем</span> я стал ходить взад и вперед, осматривая книги и картины.`,
        needCommas: false,
        trueRuleInfo: `«Между тем» может быть наречием и союзом, но не может быть вводным словом. Запятыми не выделяется.`,
        falseRuleInfo: `Неверно.
    «Между тем» может быть наречием и союзом, но не может быть вводным словом. Запятыми не выделяется.`,
        author: `А.С. Пушкин
    «Выстрел»`
      },
      {
        id: 11,
        questionText: `<span class="highlightText">Бывало</span> кто ни проедет, всякий похвалит, никто
    не осудит.`,
        correctText: `<span class="highlightText">Бывало,</span> кто ни проедет, всякий похвалит, никто не осудит.`,
        needCommas: true,
        trueRuleInfo: `Вводное слово «бывало» означает оценку обычности того, о чём говорят.`,
        falseRuleInfo: `Запятая нужна. Вводное слово «бывало» означает оценку обычности того, о чём говорят.`,
        author: `А.С. Пушкин
    «Станционный смотритель»`
      },
      {
        id: 12,
        questionText: `Этот человек в футляре <span class="highlightText">можете себе представить</span> едва не женился.`,
        correctText: `Этот человек в футляре <span class="highlightText">можете себе представить</span> едва не женился.`,
        needCommas: true,
        trueRuleInfo: `Вводная конструкция «можете себе представить» помогает привлечь внимание собеседника.`,
        falseRuleInfo: `«Можете себе представить» — вводная конструкция, помогает привлечь внимание собеседника. Запятые нужны.`,
        author: `А.П. Чехов
    «Человек в футляре»`
      },
      {
        id: 13,
        questionText: `<span class="highlightText">Действительно</span> я занимала его, и ему было весело смотреть на мой смех.`,
        correctText: `<span class="highlightText">Действительно,</span> я занимала его, и ему было весело смотреть на мой смех.`,
        needCommas: true,
        trueRuleInfo: `Запятая нужна, потому что здесь «действительно» — вводное слово.`,
        falseRuleInfo: `Запятая нужна, потому что здесь «действительно» — вводное слово. Проверка: стоит в начале предложения, можно выбросить без потери смысла.`,
        author: `Ф.М. Достоевский
    «Неточка Незванова»`
      },
      {
        id: 14,
        questionText: `<span class="highlightText">Однако</span> долг вы понимаете прежде всего.`,
        correctText: `<span class="highlightText">Однако</span> долг, вы понимаете, прежде всего.`,
        needCommas: true,
        trueRuleInfo: `Вводная конструкция «вы понимаете» помогает привлечь внимание собеседника.`,
        falseRuleInfo: `Вводная конструкция «вы понимаете» выделяется запятыми, помогает привлечь внимание собеседника.`,
        author: `И.С. Тургенев
    «Уездный лекарь»`
      },
      {
        id: 15,
        questionText: `В чем счастие <span class="highlightText">по-вашему</span>?`,
        correctText: `В чем счастие, <span class="highlightText">по-вашему?</span>`,
        needCommas: true,
        trueRuleInfo: `Вводное слово «по-вашему» выражает источник сообщения.`,
        falseRuleInfo: `Запятая нужна, потому что «по-вашему» — вводное слово, называет источник сообщения`,
        author: `Н.А. Некрасов
    «Кому на Руси жить хорошо»`
      },
      {
        id: 16,
        questionText: `Я  <span class="highlightText">признаюсь</span> не смел поднять очей.`,
        correctText: `Я, <span class="highlightText">признаюсь,</span> не смел поднять очей.`,
        needCommas: true,
        trueRuleInfo: `Запятыми выделяются вводные «признаюсь», «по совести», «смешно сказать».`,
        falseRuleInfo: `Запятыми выделяются вводные «признаюсь», «по совести», «смешно сказать».`,
        author: `А.С. Пушкин
    «Борис Годунов»`
      },
      {
        id: 17,
        questionText: `<span class="highlightText">Ради бога</span> дай мне руку: я тону.`,
        correctText: `<span class="highlightText">Ради бога,</span> дай мне руку: я тону.`,
        needCommas: true,
        trueRuleInfo: `Вводное словосочетание «ради бога» выделяется запятыми.`,
        falseRuleInfo: `Вводное словосочетание «ради бога» выделяется запятыми.`,
        author: `А.С. Пушкин
    «Роман в письмах»`
      },
      {
        id: 18,
        questionText: `Поступок твоего рыцаря меня тронул <span class="highlightText">кроме шуток</span>.`,
        correctText: `Поступок твоего рыцаря меня тронул, <span class="highlightText">кроме шуток.</span>`,
        needCommas: true,
        trueRuleInfo: `Вводные словосочетания «кроме шуток», «по сути», «правду сказать» выделяются запятыми.`,
        falseRuleInfo: `Вводные словосочетания «кроме шуток», «по сути», «правду сказать» выделяются запятыми.`,
        author: `А.С. Пушкин
    «Роман в письмах»`
      },
      {
        id: 19,
        questionText: `Легкомысленно непроницательны люди, и человек в другом кафтане <span class="highlightText">кажется им</span> другим человеком.`,
        correctText: `Легкомысленно непроницательны люди, и человек в другом кафтане <span class="highlightText">кажется им</span> другим человеком.`,
        needCommas: false,
        trueRuleInfo: `Запятая не нужна, так как это сказуемое с дополнением.`,
        falseRuleInfo: `Запятая не нужна, потому что «кажется» — сказуемое.`,
        author: `Н.В. Гоголь
    «Мёртвые души»`
      },
      {
        id: 20,
        questionText: `Ручаюсь вам если не за триумф, то <span class="highlightText">по крайней мере</span> за барыш...`,
        correctText: `Ручаюсь вам если не за триумф, то <span class="highlightText">по крайней мере</span> за барыш...`,
        needCommas: false,
        trueRuleInfo: `Запятая не нужна, когда словосочетание «по крайней мере» можно заменить на «минимум», «не меньше, чем».`,
        falseRuleInfo: `Запятая не нужна, когда словосочетание «по крайней мере» можно заменить на «минимум», «не меньше, чем».`,
        author: `А.С. Пушкин
    «Египетские ночи»`
      }
    ];

    const dashQuestions = [
      {
        id: 1,
        questionText: `Театр уж полон; ложи блещут;
    Партер и кресла |+| все кипит.`,
        correctText: `Театр уж полон; ложи блещут;
    Партер и кресла — все кипит.`,
        trueRuleInfo: `Тире ставится перед обобщающим словом.`,
        falseRuleInfo: `Тире ставится перед обобщающим словом «всё», которое стоит после однородных членов предложения «партер» и «кресла».`,
        author: `А.С. Пушкин «Евгений Онегин»`
      },
      {
        id: 2,
        questionText: `Петр Петрович, по крайней мере по моим признакам, |+| человек весьма почтенный.`,
        correctText: `Петр Петрович, по крайней мере по моим признакам, человек весьма почтенный.`,
        trueRuleInfo: `Тире не ставится, так как между подлежащим и сказуемым есть вводная конструкция.`,
        falseRuleInfo: `Тире не ставится, так как между подлежащим и сказуемым есть вводная конструкция «по крайней мере по моим признакам».`,
        author: `Ф.М. Достоевский
    «Преступление и наказание»`
      },
      {
        id: 3,
        questionText: `Я |-| честный человек и никогда не говорю комплиментов.`,
        correctText: `Я честный человек и никогда не говорю комплиментов.`,
        trueRuleInfo: `Тире не ставится, так как подлежащее выражено местоимением.`,
        falseRuleInfo: `Тире не ставится, когда подлежащее выражено местоимением.`,
        author: `А.П. Чехов
    «Учитель»`
      },
      {
        id: 4,
        questionText: `Погода |-| несносная, дорога |-| скверная, ямщик |-| упрямый — а виноват смотритель.`,
        correctText: `Погода несносная, дорога скверная, ямщик упрямый — а виноват смотритель.`,
        trueRuleInfo: `Тире не ставится, так как сказуемое — прилагательное.`,
        falseRuleInfo: `Тире не ставится во всех частях предложения, так как сказуемые в них выражены прилагательными, а тире ставится между двумя существительными, глаголами или числительными.`,
        author: `А.С. Пушкин
    «Станционный смотритель»`
      },
      {
        id: 5,
        questionText: `Мы почитаем всех нулями, А единицами|-| себя.`,
        correctText: `Мы почитаем всех нулями, А единицами — себя.`,
        trueRuleInfo: `Тире ставится в неполном предложении.`,
        falseRuleInfo: `Часть предложения — неполная, в ней пропущено сказуемое «почитаем» и на его месте ставится тире.`,
        author: `А.С. Пушкин
    «Евгений Онегин»`
      },
      {
        id: 6,
        questionText: `А гений и злодейство |+|
    Две вещи несовместные. Не правда ль?`,
        correctText: `А гений и злодейство —
    Две вещи несовместные. Не правда ль?`,
        trueRuleInfo: `Тире ставится между подлежащим и сказуемым.`,
        falseRuleInfo: `Тире ставится между подлежащим и сказуемым, так как они выражены существительными.`,
        author: `А.С. Пушкин
    «Моцарт и Сольери»`
      },
      {
        id: 7,
        questionText: `Петербург |+|
    прихожая, Москва |+|
    девичья, деревня же |+|
    наш кабинет.`,
        correctText: `Петербург — прихожая, Москва — девичья, деревня же — наш кабинет.`,
        trueRuleInfo: `Тире ставится между подлежащим и сказуемым.`,
        falseRuleInfo: `Тире ставится между подлежащим и сказуемым, так как во всех случаях они выражены существительными. Частица «же» никак не влияет на постановку тире.`,
        author: `А.С. Пушкин
    «Роман в письмах»`
      },
      {
        id: 8,
        questionText: `Встретясь с этим человеком в лесу, вы приняли бы его за разбойника; в обществе |+|
    за политического заговорщика; в передней |+| за шарлатана, торгующего эликсирами и мышьяком.`,
        correctText: `Встретясь с этим человеком в лесу, вы приняли бы его за разбойника; в обществе — за политического заговорщика; в передней — за шарлатана, торгующего эликсирами и мышьяком.`,
        trueRuleInfo: `Тире ставится в неполном предложении.`,
        falseRuleInfo: `В обоих случаях перед нами неполные предложения. В них пропущены сказуемое «почитаем» и на его месте ставится тире.`,
        author: `А.С. Пушкин
    «Египетские ночи»`
      },
      {
        id: 9,
        questionText: `Я |-| раб, я |-| царь, я |-| червь, я |-| бог.`,
        correctText: `Я раб, я царь, я червь, я  бог.`,
        trueRuleInfo: `Тире не ставится, так как подлежащее выражено местоимением.`,
        falseRuleInfo: `Тире не ставится ни в одном из предложений, так как подлежащее выражено местоимением.`,
        author: `Г.Р. Державин
    «Бог»`
      },
      {
        id: 10,
        questionText: `Честолюбие |-| есть не что иное, как жажда власти.`,
        correctText: `Честолюбие есть не что иное, как жажда власти.`,
        trueRuleInfo: `Тире не ставится, так как есть связка «есть» и отрицательная частица «не».`,
        falseRuleInfo: `Тире не ставится, если между подлежащим и сказуемым стоит глагол-связка «есть».`,
        author: `М.Ю. Лермонтов
    «Герой нашего времени»`
      },
      {
        id: 11,
        questionText: `Тамань |+| самый скверный городишко из всех приморских городов России.`,
        correctText: `Тамань — самый скверный городишко из всех приморских городов России.`,
        trueRuleInfo: `Тире ставится между подлежащим и сказуемым, выраженными существительными.`,
        falseRuleInfo: `Тире ставится между подлежащим и сказуемым, выраженными существительными.`,
        author: `М.Ю. Лермонтов
    «Герой нашего времени»`
      },
      {
        id: 12,
        questionText: `Производить эффект |+| их наслаждение; они
    нравятся романтическим провинциалкам до безумия.`,
        correctText: `Производить эффект — их наслаждение; они
    нравятся романтическим провинциалкам до безумия.`,
        trueRuleInfo: `Тире ставится между подлежащим и сказуемым, выраженным существительным и глаголом.`,
        falseRuleInfo: `Тире ставится между подлежащим и сказуемым, выраженным существительным и глаголом.`,
        author: `М.Ю. Лермонтов
    «Герой нашего времени»`
      },
      {
        id: 13,
        questionText: `Его цель |+| сделаться героем романа. Он так часто старался уверить других в том, что он |-| существо,
    не созданное для мира, обреченное каким-то тайным страданиям, что он сам
    почти в этом уверился.`,
        correctText: `Его цель — сделаться
    героем романа. Он так часто старался уверить других в том, что он существо,
    не созданное для мира, обреченное каким-то тайным страданиям, что он сам
    почти в этом уверился.`,
        trueRuleInfo: `Тире ставится, когда подлежащее и сказуемое выражены существительным и глаголом, и не ставится, когда подлежащее — местоимение.`,
        falseRuleInfo: `Тире ставится, когда подлежащее и сказуемое выражены существительным и глаголом, и не ставится, когда подлежащее — местоимение.`,
        author: `М.Ю. Лермонтов
    «Герой нашего времени»`
      },
      {
        id: 14,
        questionText: `Обязанность |-| для меня дело священное, закон — я немею пред законом.`,
        correctText: `Обязанность для меня дело священное, закон — я немею пред законом.`,
        trueRuleInfo: `Тире не ставится, так как между подлежащим и сказуемым стоит дополнение «для меня».`,
        falseRuleInfo: `Тире не ставится, так как между подлежащим и сказуемым стоит дополнение «для меня».`,
        author: `Н.В. Гоголь
    «Мёртвые души»`
      },
      {
        id: 15,
        questionText: `Отчизна |-| есть то, что ищет душа наша, что милее для нее всего. Отчизна моя |+| ты.`,
        correctText: `Отчизна есть то, что ищет душа наша, что милее для нее всего. Отчизна моя — ты.`,
        trueRuleInfo: `Тире не ставится, если в предложении есть слово «есть». Обычно тире не ставится в предложениях с местоимением, но его можно использовать для особой экспрессии.`,
        falseRuleInfo: `Тире не ставится, если в предложении есть слово «есть». Обычно тире не ставится в предложениях с местоимением, но его можно использовать для особой экспрессии.`,
        author: `Н.В. Гоголь
    «Тарас Бульба»`
      },
      {
        id: 16,
        questionText: `Экипажи, дом, отлично устроенный, вкусные обеды |+| вот что беспрерывно носилось в голове его.`,
        correctText: `Экипажи, дом, отлично устроенный, вкусные обеды — вот что беспрерывно носилось в голове его.`,
        trueRuleInfo: `Тире ставится перед обобщающим словом «что».`,
        falseRuleInfo: `Тире ставится перед обобщающим словом «что».`,
        author: `Н.В. Гоголь
    «Мёртвые души»`
      },
      {
        id: 17,
        questionText: `Они смотрели друг на друга: Райский |+| с холодным любопытством, она |+| с дерзким торжеством.`,
        correctText: `Они смотрели друг на друга: Райский — с холодным любопытством, она — с дерзким торжеством.`,
        trueRuleInfo: `Тире ставится в обоих случаях на месте пропущенного сказуемого «смотрели».`,
        falseRuleInfo: `Тире ставится в обоих случаях на месте пропущенного сказуемого «смотрели».`,
        author: `И.А. Гончаров
    «Обломов»`
      },
      {
        id: 18,
        questionText: `Мысль изречённая |-| есть ложь.`,
        correctText: `Мысль изречённая есть ложь.`,
        trueRuleInfo: `Тире не ставится, если в предложении есть глагол «есть».`,
        falseRuleInfo: `Тире не ставится, если в предложении есть глагол «есть».`,
        author: `Ф.И. Тютчев
    «Silentium!»`
      },
      {
        id: 19,
        questionText: `Поэзия —
    Не профессия,
    Поэзия |-| как любовь.`,
        correctText: `Поэзия —
    Не профессия,
    Поэзия как любовь.`,
        trueRuleInfo: `Тире не ставится, если есть отрицание «не».`,
        falseRuleInfo: `Тире не ставится, если есть отрицание «не».`,
        author: `В.Д. Фёдоров
    «Поэзия — не профессия...»`
      },
      {
        id: 20,
        questionText: `Я не знал, что любовь |+| зараза,
    Я не знал, что любовь |+| чума.
    Подошла и прищуренным глазом
    Хулигана свела с ума.`,
        correctText: `Я не знал, что любовь — зараза,
    Я не знал, что любовь — чума.
    Подошла и прищуренным глазом
    Хулигана свела с ума.`,
        trueRuleInfo: `Тире ставится, когда подлежащее и сказуемое выражены существительными.`,
        falseRuleInfo: `Тире ставится, когда подлежащее и сказуемое выражены существительными.`,
        author: `С.Есенин
    «Пой же, пой. На проклятой гитаре...»`
      },
      {
        id: 21,
        questionText: `Песня с бурей |-| вечно сестры.`,
        correctText: `Песня с бурей вечно сестры.`,
        trueRuleInfo: `Тире не ставится, когда между подлежащим и сказуемым стоит обстоятельство.`,
        falseRuleInfo: `Тире не ставится, потому что между подлежащим и сказуемым стоит обстоятельство «вечно».`,
        author: `В. Брюсов
    «Кинжал»`
      }
    ];

    return { commaQuestions, timerQuestions, dashQuestions };
  }

  // Overrides the genId method to ensure that a item always has an id.
  // If the array is empty,
  // the method below returns the initial number (1).
  // if the array is not empty, the method below returns the highest
  // item id + 1.
  genId(questions: Question[]): number {
    return questions.length > 0 ? Math.max(...questions.map(question => question.id)) + 1 : 1;
  }
}
